[
    {
      "title": "His Holiness Baba Ji Sarkar (RA) – Education",
      "content": "H. H. (His Holiness) Baba Ji Sarkar (RA) acquired his elementary education at home according to the Islamic traditions.\n\nFrom the very childhoood he had established his inquisitive brilliance of mind and thought. For higher education in Islamic jurisprudence (Fiqh) and Sharia he underwent long journeys to various centres of Islamic learning at the time.\n\nAt the early age of twenty he had completed his education in various disciplines of Islam. After education attainments he devoted himself to prayers and preaching the message of Islam.\n\nHe also had laid foundation of the Masjid (Mosque) in Murree region where he was Imam of the mosque and used to teach children and deliver daily lectures on different subjects of the religion.\n\nSoon he became famous as a man of great learning. Hundreds of truth-seekers would sit around him and would listen to his beautiful preachings. The light thus started spreading far and wide. His name became known as household name both near and far. This is the glory and fame he attained on the formal side of his education. But still a greater lasting fame was awaiting him. And that was his spiritual height he conquered during his lifetime."
    },
    {
      "title": "His Holiness Baba Ji Sarkar (RA) - Spiritual Enhancement",
      "content": "H. H. (His Holiness) Baba Ji Sarkar (RA) was a professional wrestler before he became he received his higher Islamic education. He used to win all the competions and was very famous wrestler. One day when he won the competion as he was coming out of the fighting ring, an old Saint was passing by who said to him \"Allah has not created you for this, you have to serve a very big purpose\". At this point in his life he stopped wrestling and went to receive his higher education as explained in \"His Holiness Baba Ji Sarkar (RA)'s Education\" section.\n\nHe felt inside the spiritual thirst for which he travelled on foot many places in search for the spiritual guide. He met Baba Fazal Shah Kalyami (RA) of Kalyam Awan (a place near Rawat, Rawalpindi District in Pakistan), who was a Qalandar (Very high spiritual status among Sufis) of his time whose Namaz-e-Janaza (Funeral Prayer) was led by Qutb-al-Aqtab Ala-Hazrat Pir Mehr Ali Shah Sahib (RA) of Golra Sharif in Capital Islamabad of Pakistan. Baba Fazal Shah (RA) told him that his Bait is not at his hands, he should goto the mountains of Kashmir wher he will found his Murshid. Qalandar Baba Fazal Shah Kalyami (RA) also gave him the dried flower and told him to keep it safe whenever this flower will come back to life you will know that you found your Murshid. (Inshallah more will be added in future regarding his meeting with Qalandar Baba Fazal Shah Kalyami (RA).)\n\nHis Nobleness Hazrat Baba Ji Sarkar (RA) undertook onfoot journey and received spiritual inspiration from his Murshid (Guide) His Holiness Ghous-e-Zaman Khawaja Nizamuddin Aulia of Kahiyan Sharif in Neelam Valley, Kashmir. The Murshid acquainted his disciple with all the stages of spiritualism at a single glance. And after spending few days at the Dargah of His Holiness Ghous-e-Zaman Khawaja Nizamuddin Aulia, the Baba Ji Sarkar (RA) was bestowed with Khilafat and asked by his Murshid to take his sojourn at Mohra Shareef, Murree. At that time this place was not as it looks today. It was the habitat of savage wildlife like leopards, lions, etc.\n\nThe Baba Ji Sarkar (RA) according to the advice of his Murshid Paak undertook a 40-day spiritual ordeal (chillah). The stone slab on which the Baba Ji Sarkar (RA) sat for 40 days (day-and-night) is preserved even today as a relic (Taburrak) at Mohra Shareef. Who new at that time that Fortune was working silentl to bring brilliance and worldwide fame to Mohra Shareef.The place became a permanent abode of Khawaja afterwards. It was here that he spent the rest of his life. Millions of devotees assemble every year at this Centre to pay homage to the auspicious soul of His Highness the Khawaja of the East, Hazrat Pir Muhammad Sadiq (Baba Ji Sarkar) (RA) - The Lion of Allah and the Patron Saint of the East.\n\nDuring his lifetime he brought thousands of Non-Muslims to Islam specially the region of Kashmir including Kotli who was largely inhabitant by Hindus at that time. It was Khawaja who brought these people to Islam."
    },
    {
      "title": "History of Khanqah of Mohra Shareef - The Great Spiritual Center",
      "content": "\"Mohra Sharif\" (Holy Village; Mohra for \"small village\" and Sharif for \"holy\" or \"noble\") is an great spiritual center and home of the Naqshbandia, Mujaddadiya. Qasimiya sufi order, is a Naqshbandi in origin, and is based in a small village called Mohra Shareef located in the Murree hills of Punjab, outside the Pakistani capital of Islamabad. It is located at the Eastern flank of Islamabad about one and a half hours drive from the Islamabad. It was made into a spiritual center by Ghous-e-Zaman Ala-Hazrat Baba Ji Khawaja Muhammad Qasim Sadiq (RA) (b. 1263 A.H.).\n\nHazrat Khawaja's ancestors were migrated from Iran and setteled in Rawalpindi District of Pakistan. Hazrat Khawaja Sahib was the Ghaus-e-Zaman of his time better known among the great Sufis as the Spiritual Sun on the horizon of the East. Hazrat Khawaja Baba Ji's 120 years of life forms a proud chapter of Islamic renaissance in this region of Asia.\n\nHis Holiness Hazrat Baba Ji Muhammad Qasim Sadiq Passed away on the 20th November of 1943 leaving behind millions of disciplines and devotees to mourn him. His funeral prayers were offered three times on the day of his demise due to ever swelling number of mourners attending his funeral.\n\nNote: RA is a short for \"Rehmatullah Alay\" means Allah's blessings upon him.\n\nAfter his departure from the world, the Order led by his son Qutab-ul-Aqtab Qutb-e-Alam Ameen-ul-Ummat Khawaja Gharib Nawaz Ala-Hazrat Pir Muhammad Zahid Khan Sahib Known as Pir Khan Sahib Khawaja Gharib Nawaz. During his life time, Hazrat Baba Ji Muhammad Qasim Sadiq (RA) had chosen out of his 6 sons, his third son Khwaja Pir Muhammad Zahid Khan Sahib (RA) as his successor due to his outstanding pious and righteous character. Khawaja Gharib Nawaz was the first Sajjad Nasheen of Mohra Shareef. He was loved and respected by millions across the world. During his lifetime, he appointed his eldest son, Pir Aftab Ahmed Qasmi, his successor. But Pir Aftab Ahmed Qasmi Sahib passed away one year before Khawaja Gharib Nawaz. Khawaja Gharib Nawaz passed away on December 9th, 1993 and after his departure from this world, the order led by his second son Wali-e-Kamil Hazrat Pir Keumras Badshah known as Hazrat Khawaja Pir Badshah Sahib, who passed away on 13th August, 2008. After Pir Badshah's departure from this world, Pir Auliya Badshah Farooq Sahib become the third Sajjada Nasheen (Custodian of Holy Shrine) of Mohra Sharif.\n\nTwice a year, in last week of May and November, there are congregations (URS Paak), attended by thousands of devotees from all four corners of the world, held to commemorate Hazrat Khawaja Pir Muhammad Qasim Sadiq's (Baba Ji Sarkar), Qutab-ul-Aqtab Qutb-e-Alam Ameen-ul-Ummat Khawaja Gharib Nawaz Pir Khan Sahib (RA), Imam-ul-Aarifeen Hazrat Khawaja Pir Aftab Ahmed Qasmi (RA) and .Wali-e-Kamil Hazrat Pir Keumras Badshah known as Hazrat Khawaja Pir Badshah Sahib (RA)."
    },
    {
      "title": "His Highness Ghous-e-Zaman Baba Ji Sarkar (RA)'s Last Advice",
      "content": "About two weeks before his breathing last while in \"Isha\" prayers he summoned members of his family and \"Khulfa\" to advice them to remain very kind, generous and helpful to every body who comes to them. He adviced: \"whosoever comes to you he should be treated gently, kindly and fatherly. No room should be brooked for prejudice, envy, bias, etc.\"\n\nAt the conclusion of his precious advice he took off his Dastar (Turban) and conferred on His Glory Aaala Hazrat Khawaja Pir Muhammad Zahid Khan Sahib (RA) who is popularly known as Hazrat Khawaja Pir Khan Sahib (RA)."
    },
    {
      "title": "His Highness Ghous-e-Zaman Baba Ji Sarkar (RA) - Silsilla (Tariqa) - Spiritual Order",
      "content": "The order of Sufis (Mystics or Sainthood) preached by the Khawaja Baba Ji Sarkar (RA) and continued by his family today is Naqshbandia, Mujadidia and Qasmia. Baba Ji Sarkar (RA) was given permission from his Murshid His Holiness Khawaja Nizamuddin Aulia of Kahiyan Sharif in four orders - Chistiya, Qadriya, Suhrwardia and Naqshbandia. But Khawaja mainly preached Naqshbandia and Qadriya orders.\n\nHis Holiness Hazrat Baba Ji Muhammad Qasim Sadiq Passed away on the 20th November of 1943 leaving behind millions of disciplines and devotees to mourn him. His funeral prayers were offered three times on the day of his demise due to ever swelling number of mourners attending his funeral."
    }
  ]