{
    "collection": "Shaykh ul Aalam’s Advice for the Seeker",
    "lectures": [
        {
            "title": "1. The Light of Ala Hadhrat Imam Ahmad Raza Khan",
            "dateHijri": "Saffar 1431H",
            "dateGregorian": "January 2010",
            "location": "Ala Hadhrat Conference – Birmingham",
            "video": "Watch the full Urdu speech video here",
            "content": "The Shaykh said:\n\nImam e Ahlus Sunnah, Ala Hadhrat, Shah Ahmad Raza Khan Barelwi, may Allah’s mercy be upon him. We repeatedly honour and revere him because, since his youth, he had established a fort of salvation for all Muslims to come, until Qiyama. What is this fort? It is the yearning of love for the Prophet. It is the wall of respect (azmat) for the Prophet. It is dhikr and devotion for the love of the Prophet (hubb e Nabi). Whoever finds easy the state of love of the Prophet, and dhikr and devotion, he is a believer. And whoever is a believer, he is entitled to salvation.\n\nAla Hadhrat bestowed a favour upon the entire Islamic community (millat-e-Islamiyya); with the force of pen and tongue, he repelled the onset of a rising flood or storm [of evil]. Calamity [of the Salafi and Wahhabi movement] rose up in Najd and he safeguarded the solidarity of the community. The people had become ruined, devotees of the Prophet (aashiqeen-e-Rasul) were slaughtered in the streets, arrows struck them from behind whilst they performed salah and had not yet risen from sujood. For days and weeks, corpses of the aashiqeen lay in the masjids. Then came an era when insolence, abuse, disrespect and abusive words were used towards the blessed personality (zaat-e-aqdas) [of the Messenger of Allah], to quench the thirst of their [deviant] hearts and keep them busy in slaughtering his aashiqeen.\n\nThen came a time when, having crossed the trench of corruption, the aashiqeen of the Prophet rose up, again unsheathed their swords; the Muslim men and women slit the jugular veins of the abusers (gustaakhon), thus the flood of insolence of such lives disappeared just as water is absorbed by the sand, and vanished unknown into the valleys of annihilation.\n\nThen those [corrupt] people began to escape here and there, and some time passed in silence.\n\nThen a sound arose from India, that the blessed personality of the Master of the worlds (Sayyid e Aalam), peace and blessings of Allah be upon him, had become the target of criticism, insulting words were used, books were written, gatherings became places to insult the Prophethood (jalwa-e-nubuwwat). Then, Imam e Ahlus Sunnah – for he did not just merely become Imam-e-Ahlus Sunnah! Nor does anyone simply become such. To be given such a title is distinguished, for such a title is only given [and not self-acclaimed]. And it is not simply given [to someone], it is chosen for them in acknowledgement of their khidmat (service).\n\nSo, he was chosen by the Power of Allah for the sake of handling those who disrespect the Master of both worlds, peace and blessings of Allah be upon him. Thus, beginning from his youth, at twelve or thirteen years of age, he had prepared his barricade and sat ready with his bow and arrow. Wherever any sound arose [of disrespect towards the Messenger of Allah], there he fired his arrow. Wherever it was! If anyone opened their mouths [in disrespect], he fought back with his pen. If anyone lifted their feet [with the intention of disrespect], he obliterated them. If anyone lifted their feet [with the intention of proceeding with disrespect], he made their efforts fruitless. And if anyone raised their eyes in disrespect, he would blind them with the sparks of love! If anyone opened their mouths in disrespect, he would fight them.\n\nMy respected people, why? And to this day, the buzz of the dhikr of the Prophet continues to blossom.\n\nPeople think, “They [the Ahlus Sunnah] insult and fight, and divide the community.” Those who use such words, I say to them: That community, which has recited the kalima of the Prophet, but their remembrance consists of disrespecting and insulting the Prophet and constantly attacking the personality of the Prophet, does your honour/integrity (ghayrat) not respond? And then, when someone stops them, you say that such a person has divided the community?\n\nAnd furthermore, is there any such person in this world who smiles when hearing abuse towards his own father? Would you or any other honourable person tolerate insults, abuse and enmity hurled towards your mother and father – and the use of indecent, improper words towards them? Would such a person be called a son, who smiles when he hears such insults and is delighted at it? Such a person is not a son, is he? No one would approve of him.\n\nSo then, if one cannot remain silent when hearing abuse against his mother and father, what about the blessed personality for whom millions of mothers and fathers would sacrifice themselves!\n\nAnd if one does disrespect the Beloved, if you can’t fight him, you must at least stop him. And if you cannot stop him, then you must at least leave his gathering (majlis). You can leave his friendship. Because don’t you know, that whoever you are [friends] with in this world, you will be raised with on Yawm al Qiyama?"
          },
          {
            "title": "2. Certainty of Prophethood",
            "dateHijri": "28th Ramadan 1433",
            "dateGregorian": "16th August 2012",
            "content": "The Shaykh said:\n\nIf one was to say that the land had ascended and the skies had come down, it is all possible. If one was to say that the ocean had caught fire and the rivers were ablaze and burning, these are all possible states. They can happen. It is part of Allah’s Power (qudrat). However, if one was to say, “such-and-such statement of the Prophet is false”, that is impossible, that is impossible, that is impossible. Everything is possible except to doubt the truthfulness of the Prophet’s speech.\n\nIf and when, anyone suspects that “such-and-such statement of the Prophet is not true”, at that very point, the person becomes a kaafir (unbeliever)."
          },
          {
            "title": "3. Analogy of the Life of this World",
            "dateHijri": "28th Ramadan 1433",
            "dateGregorian": "16th August 2012",
            "content": "The Shaykh said:\n\nI have seen nowadays that people carry their luggage [in a suitcase] attached to a handle and two wheels. I have not yet, however, seen anyone push it from behind – instead, I have seen that the person goes ahead whilst the suitcase follows behind. And the extraordinary thing is that he does not look behind him to see “how is the suitcase doing?” He does not look back; he simply continues to walk ahead listening to the sound of the wheels. He does not observe behind – why? Because the successful traveler (musaafir) does not look back, he does not remove his sight from his destination.\n\nO believer, you are traveler. And what is your final point (inteha)? Belonging to the Door of the Prophet, your home is Jannah. That is where your sight is. Your luggage i.e. the world, keep it behind you! Keep the Door of your Beloved in front. Why should the world come in between you and your Beloved? Do not leave it [the world] yet do not keep it in between. Keep it behind you, and you proceed ahead. Yet do not leave it. Your pace (raftaar) shall not stop, nor shall your character (kirdaar) decrease, nor shall your speech (guftaar) be at fault, nor shall the signs in your vision diminish. That is the beautiful life of a believer.\n\nWhen the person grasps the suitcase with two wheels, he does not let go. Yet how different it is when, at the time of sleep, the suitcase is released. When the person sleeps, everything goes. That which he had grasped in his hand for a whole ten hours, now the grip of his hand upon it loosens; the handle goes, everything goes. Allah! But when does he sleep? Once he has reached his destination. Which sleep is this? Respected ones, this is the final sleep; the final sleep. In the final sleep, the suitcase has been released; at this time, the eyes are closed, and when they open, the suitcase is not there, the Master of both worlds (kawnayn ka Sultan i.e. Sayyidina RasulAllah) is in front of him.\n\nThose who kept the suitcase ahead of them, they became of no use, disgraced, nameless. Yet those who kept that suitcase behind them, they became successful (shaad kaam), elevated in rank (ba maqaam), esteemed in name i.e. granted good reputation.\n\nPut this world behind you, keep the Beloved Master in front. And proceed, proceed, proceed.\n\nDo not abandon this world, but tell this world: “I have my hand upon your neck; you are not the ruler (haakim) over me, I am your ruler.” Do not live according to the wish of the world, but enforce it to submit according to your wish. And you should only submit according to the wish of the Master (i.e. Sayyidina RasulAllah). Lower yourself, so that when the Master raises you, it will be past the ‘Arsh (Divine Throne) and towards the Vision of the Lord."
          },
          {
            "title": "4. Zuhd (Asceticism)",
            "dateHijri": "28th Ramadan 1433",
            "dateGregorian": "16th August 2012",
            "content": "The Shaykh said:\n\nHe is called an ascetic (zaahid) whose asceticism, steadfastness (taqwa) and deeds (amal) are so dominant that within his soul, heart and mind, sin has no effect. He is called a zaahid. And the one who is always free from sin and whose fate comes from the radiant light of virtue, his is the rank (maqaam) of a devotee (aashiq).\n\nJami (the poet) said:\nThat [state] which, despite forty years of sajda, the servant was unable to attain,\nThe devotee passed through with just one sigh!\n\nWhich person is this? It is the person who says: my life is for Allah, my body is a trust from Him, my wealth is a trust from my Lord. If I speak, I speak for Him; if I see, then it is for Him. Some say: “My wealth is for Him, my existence is for Him, my honour is for Him, my dying is for Him, my living too is for Him.” And the wise say: “We have nothing except that it is He, it is He, it is He!”\n\nThat is the way of Jami, who says:\nYou ask about the limits of my longing and love (muhabbat),\nIf you should ask, then it is that the whole universe is a mirror in which I see my Beloved (Allah)!\n\nRespected people! Those are the ones whom whilst living in this world, when the wind blows [for them], it blows from there (the Divine Realm). And when they enter the grave, the entire graveyard becomes Jannati. And when they approach the field of the Hereafter, the doors of Jannah will open, and Jannah will approach them in peace! Those are such people, whichever clothes they may wear – for, does Allah look at one’s clothing? The Messenger of Allah, the Master of the Worlds (Sayyid al Kainaat), Distributor of Jannah and Kawthar (Qaasim e Jannat o Kawthar), may Allah bless him and grant him peace, said: “Allah does not look at your appearances” i.e. Allah does not look at your clothing, Allah does not look at your food, Allah does not look at your food, drink, abode. “Wa la kin yanzuru ila quluubikum”, if He wishes to, He looks only at your heart. He does not look at your clothing. Otherwise, the Command would be: from East to West, maintain only the clothing which Allah prefers and there would be no other garment!\n\nPeople think that Allah is only pleased with dry bread (referring to poverty), so then what of this entire world filled with food? Thus, it is said: the food is yours, the land is yours, the skies are yours, the sun and moon, the autumn, the winds, all of these are yours; honour, wealth, prosperity are all yours – only, that heart of yours should belong to Me (i.e. to Allah, Most High)."
          },
          {
            "title": "5. The Command “Be!”",
            "dateHijri": "4th Shawwaal 1433",
            "dateGregorian": "22nd August 2012",
            "content": "The Shaykh said:\n\nA question was posed by a good, knowledgeable friend of mine, who brought it to attention that; the term kun (Be!) in Arabic is the formula for matters/affairs. So when, nothing else existed apart from Allah’s Being, to what was kun said and how was the universe created?\n\nIn actual fact, when nothing existed and Allah said kun, it was to that which Allah had in His Thought (khyaal); He brought it near, and commanded kun (Be!)\n\nAnd that much is enough."
          },
          {
            "title": "6. State of the Muslim Ummah",
            "dateHijri": "19th Shawwaal 1433",
            "dateGregorian": "6th September 2012",
            "content": "The Shaykh said:\n\nThere will be difficulties (mushkilaat).\n\nI will tell you this: to everyone who has recited the kalima, hardship awaits you with open jaws. The lava which has erupted is approaching you. [So] stop rejoicing that you are such a wealthy man, or you shall be drawn out as hair is drawn out from butter. Strengthen your state. For this reason, establish your aim. Stores are not your aim, a bank balance is not your aim. Do not be in opposition of the laws here; act in accordance to the authorities but uphold the flag of the Muhammadan way, may the peace and blessings of Allah be upon him.\n\nAnd establish such institutions so that your children will become sincere (mukhlis), serious-minded (sanjeeda), noble in character (baa ikhlaaq); [and that they may be] ones who uplift [people’s] states and when they speak, they emit the fragrance of the character of the Prophet. This is the way for you to attain success!\n\nAll the people organise programmes and are in agreement [with each other]. Yet, o Muslims, when you organise an event, until your clothes have been torn and until you are fighting each other late into the night before you depart home – until this point, no one even calls you a Muslim! Is this your way of life? For this reason, come to agreement (muttafiq). Come to agreement [with each other] and raise the standards of deen.\n\nScholars refuse to walk behind scholars, pirs (spiritual guides) refuse to follow pirs, Sufis refuse to follow Sufis; where in religion is this written?\nWhich text is this based upon? Through which book was this conveyed? Where is it amongst the thousands of Hadith? Then why do it?\n\nOnce, in India, all the scholars had gathered in their millions to try and come to an agreement that, after this day, there will be no more dispute [amongst each other]. A man there, Abul Kalam Azad, stood up and gave a speech saying,“People remove this talk from your heart. We will not agree; this is a lie, this is foolishness. We agree with each other that we will disagree.” Is this the way of Muslims?\n\n“Yeh shahadat gah-e-ulfat mein qadam rakhna hai\nLog aasan samajhte hein Musalman hona.”\nIt is to provide proof and witness of faith at every step;\n(Yet) people think that it is easy to be a Muslim.\n– Allama Iqbal\n\nTo the Muslims living in Europe, become one and serve the deen. And earn money, eat, feed your families, feed your children,take care of your elderly – your elderly; give up the conflicts.\n\nAnd that provision which Allah has given to you, none can take away. The honour which Allah grants you, none can seize. The life which Allah has given you, none can decrease it. If you have friendship, it won’t increase; if you have enmity, it will not decrease. So for what reason do you cause yourself hardship?\n\nYour wealth is yours, your hands are yours, your mouth is yours. Since your morsel will (inevitably) reach your mouth, then why are you troubled?"
          },
          {
            "title": "7. Accepting the Divine Decree (Servanthood & Bayazid Bustami)",
            "dateHijri": "Unknown",
            "dateGregorian": "Unknown",
            "content": "The Shaykh said:\n\nBayazid Bustami, may Allah be pleased with him, with several of his companions, was going somewhere in a valley between two mountains. They stood in this narrow valley, and there they began to unveil [spiritual] mysteries and secrets. He had just began to discuss these mysteries and secrets when [suddenly] he stopped. A dog approached. It ran but couldn’t find a way through, so it went back and ran off again. Finally, the dog began to bark. Its voice reached the ears of Janab Bayazid Bustami.\n\nAfter a moment of silence, he said to his companions: “Leave the path; the dog is asking us to give way [to him].”\n\n“Leave the path. The dog is seeking the path.”\n\nWhen they had moved, the dog arrived without fear and stood directly in front of Bayazid Bustami, may Allah be pleased with him. [It began to] bark and cry out, expressing many things, making a great amount of noise and then left.\n\nHe (Bayazid Bustami) remained silent for some time.\n\nHis companions asked, “Huzoor, the dog came and stood immediately in front of you and then left, after having loudly raised its voice in various ways. So, what do you make of this?”\n\nHe replied: “The dog first said:\n\n‘Why did you leave the path? Are you one who shows the Path, or one who abandons it?’\n\nAnd secondly:\n\n‘Do not discriminate, o Bayazid! For, I am a dog, right? My Lord created me as a dog, and He is pleased at my being a dog. Therefore, since my Lord is pleased that I am a dog, although you may view me with disgrace a thousand times, I am pleased because my Lord is pleased!\n\nEven if you would hurl stones at me a thousand times, shun me away, not allow me to approach you, I am happy. Why? Because I am part of the creation of my Allah. And when Allah decreed, He Wrote my appearance, my status and my end. I am pleased with the Will of my Lord.\n\nBayazid! If I – as a dog, an impure and disliked creature, one completely forbidden and cursed – if I am pleased, then by the connection of Allah’s Beloved, you have come donning the garment of His Love – therefore do not be arrogant in life! The Lord is one for all!\n\nAnd just as I am content with my Lord, o mankind, be content with the decisions of your Lord!'”",
            "video": "Watch the video clip with English subtitles here"
          }
    ]
  }
  