
  {
    
    "subtopics": [
      {
        "title": "2. Birth and Blessed Name",
        "content": "His Eminence, the most esteemed Shaykh, Khwaja Ghulam Mohiuddin Ghaznavi was born in 1322H (1902 AD) in the famous region of Ghazni, Afghanistan. The exact date of his historic birth is not known although it is reported by some as 11th April. His parent named him “Ghulam Mohiuddin” (the title Mohiuddin refers to Sayyidina Ghawth ul Aazam, meaning “Reviver of Religion”, and the title Ghulam means one who serves and follows.)\n\nOnly Allah Most High knows the noble thoughts of Khwaja Ghaznavi’s parents when they gave him this name, for Allah indeed elevated him to become “Ghulam Mohiuddin” (i.e. the true servant of Sayyidina Ghawth ul Aazam) and chose him to be a Reviver (mujaddid) and propagator of Islam."
      },
      {
        "title": "3. Father of Khwaja Ghulam Mohiuddin Ghaznavi",
        "content": "The name of Khwaja Ghulam Mohiuddin’s father was Malik Mohammad Akbar Khan, may Allah’s Mercy be upon him. He was a very prominent and well-loved figure in the region of Ghazni, Afghanistan. ‘Malik’ in Pashto (the native language of Afghanistan) means one who is a land owner and leader.\n\nHowever, Allah says in the Qur’an, “inna akramakum ‘indallahi atqakum.” [“Verily, the noblest of you in the sight of Allah is the one who is most righteous.” – Qur’an 49:13] i.e. Respect and status is not earned through family or tribal lineage but through piety and fear of Allah, and that one who is true and sincere is amongst the Accepted Ones in the Court of Allah. Family lineage or tribal allegiance has no place in tareeqa, which is the Path of Love for Allah. According to the Qur’anic statement of “wa ja`alnakum shu`uban wa qaba’ila li-ta`arafu” [“And (We have) made you peoples and tribes that you may know one another.” – Qur’an 49:13], tribal or family connections are only for identity.\n\nMalik Mohammad Akbar Khan, may Allah’s Mercy be upon him, was from the Kamaal Khayl family, a branch of the Ali Khayl generation. Amongst his forefathers was the renowned scholar and speaker of his time, Hadhrat Wali Mohammad, may Allah’s Mercy be upon him. Due to this respectful and pious lineage, Malik Mohammad Akbar Khan’s family was regarded as one of high esteem and spirituality."
      },
      
        {
            "title": "4. Family Lineage",
            "content": "The ancestry of Khwaja Ghulam Mohiuddin Ghaznavi, according to his noble brother Khwaja Pir Saani Sahib, may Allah’s Mercy be upon them both, links back to the great Companion, leader and commander of Islam, Sayyidina Khalid ibn Waleed, may Allah be well pleased with him. The full family lineage is however unknown to this day.\nKhwaja Ghaznavi’s ancestors were great businessmen and his father, Malik Mohammad Akbar Khan, was a very successful merchant who often used to travel from Afghanistan to Punjab, and even Lahore, for business."
        },
        {
            "title": "5. Early Life and Education",
            "content": "Khwaja Ghulam Mohiuddin’s childhood was spent in a very pious environment. Around the age of 4, he began his education and studied naazra (basic Qur’an recitation) and basic Persian books taught by his uncle, Hadhrat Mawlana Gul Mohammad, may Allah’s Mercy be upon them both. Hadhrat Mawlana Gul Mohammad was not only a renowned scholar but also a Sufi, and he enlightened his young student about the seen and Unseen.\nIt is said that the early stages of one’s childhood ultimately has the most effect on a person’s life. Hadhrat Mawlana Gul Mohammad’s guidance provided Khwaja Ghulam Mohiuddin with a head-start in spiritual enlightenment."
        },
        {
            "title": "6. Khwaja Ghaznavi’s Religious Education in Ghazni",
            "content": "After gaining knowledge from his uncle, Khwaja Ghulam Mohiuddin Ghaznavi travelled to the neighbouring city of Zurmat, Afghanistan and studied in a madrasa (Islamic educational institute). He then went to the famous area of Gardez, to a town called Logar, and gained knowledge from the teachers there. In this way, his early years were mainly spent in study. However, certain unforeseen circumstances meant that he could not complete Dars-e-Nizami and instead spent the remainder of his early life with his father on business. His early state was one of dhikr (remembrance of Allah) and fikr (contemplation), and he was a great lover of the Sufiya and the teachings of tasawwuf. From his personality, mannerisms and character, it was apparent that Khwaja Ghaznavi was destined for great honour. Spiritual personalities could see the light of wilayat in his forehead, and they immediately recognised that this young man would become a radiant sun in the skies of sainthood."
        },
        {
            "title": "7. A Meeting with a Spiritual Guide",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi once said, “While I was a student, one day I met a spiritual person and qalandar who observed me attentively, and said, “Son! The sign of Ghawthiyat is resplendent on your forehead. You will become the Ghawth of your time.” Then he also added, “But, the spring of your fayz (spiritual grace) is not in these lands. It is in India (Hindustan), in the region of Punjab.”"
        },
        {
            "title": "8. Visit to the Holy Shrine of Khwaja Yaqub Charkhi",
            "content": "During Khwaja Ghulam Mohiuddin Ghaznavi’s education, he once went with his teacher, Hadhrat Mawlana Ameer Alam Khan Sahib, and some of his classmates to attend the holy shrine (mazaar sharif) of Khwaja Yaqub Charkhi, may Allah’s Mercy be upon him. After reciting some prayers, Khwaja Ghaznavi went to meet the Sajjada (spiritual successor) of the shrine at the time, known famously as Haji Sahib. Haji Sahib, may Allah’s Mercy be upon him, showered his utmost love and affection upon each of Khwaja Ghaznavi’s classmates and asked them individually about their wellbeing. When he came to Khwaja Ghaznavi, he observed his face intently for a while as if he had recognised the light of Sufism in his blessed forehead."
        },
        {
            "title": "9. From Ghazni to India",
            "content": "For a while, Khwaja Ghulam Mohiuddin Ghaznavi and his father did business in Ghazni and Gardez, Afghanistan. However, when he became 22 years of age, he left Afghanistan for the city of Punjab, India. Khwaja Ghaznavi himself said: “When I left Ghazni for India, at that time, I was 22 years old.” According to this quote, this happened in the year 1924, when Afghanistan was under the rule of Amir Amanullah Khan. Khwaja Ghaznavi, may Allah be pleased with him, also experienced the reign of Amanullah Khan’s father, Habeebullah Khan. Khwaja Ghaznavi said: “At the time of Amir Habeebullah Khan’s reign, I was 12 years of age.”\nPir Ibrahim Sahib and Nazar Khan Sahib accompanied him on this journey (to Punjab). From India, Khwaja Ghaznavi also travelled to Rawalpindi, Gujar Khan and Jhelum on business. They then permanently resided in Kashmir, in the district of Poonch, where business was extremely prosperous for them. Khwaja Ghaznavi would purchase goods from Rawalpindi, Gujar Khan and Jhelum to sell in Poonch. Within a short while, his character and eloquent speech were well-known throughout the land."
        },
        {
            "title": "10. Determination for Early Rising",
            "content": "At the peak of Khwaja Ghaznavi’s adulthood, even during busy times, his fasting, salah and early rising were not affected. He would spend most of the night in the remembrance of his Lord. Even at that time, people acknowledged his taqwa (piety) and tahaarat (purity).\nIt is related that there was a lady who used to bring milk daily for his tea, and she had no children. One day, he prayed for her to be blessed with a son. Allah blessed her with a son that same year and his name was Pir Mohammad, who is still alive to this day.\nFrom the very beginning, Khwaja Ghaznavi was extremely passionate about the saints of Islam. For this reason, he would visit and pay homage to these saints with much reverence and admiration. One day, as per usual, he was travelling for business when he met a group whose leader was a famous man named Ballor Khan, so Khwaja Ghaznavi asked him where they were heading. He replied that they were going to the service of Hadhrat Baba Ji Sahib, Khwaja Qasim Sadiq Mohrvi, to meet him and kiss his blessed feet and partake in the yearly Urs Mubarak event in Mohra Sharif (in the district of Rawalpindi). Here, Allah Most High knows, that the blessed name of Khwaja Qasim Mohrvi made such an impact that Khwaja Ghaznavi immediately took out some money from his pocket and gave it to Ballor Khan, saying: “Please give this to Hadhrat Baba Ji Sahib on my behalf and humbly request that he accept this small gift from this traveller from Ghazni, and convey my greetings (salam) to him.”"
        },
        {
            "title": "11. Beginning of the Spiritual Journey",
            "content": "It was through these blessings and offerings that a great spiritual connection emerged, which thereafter resulted with an everlasting spiritual link.\nBallor Khan and a small group of his companions travelled for many days through the difficult terrain of the Poonch region of Kashmir, and their route consisted of rivers, lakes, sky-high mountains and treacherous roads. Eventually, they reached the blessed darbar (spiritual centre) of Mohra Sharif. Ballor Khan arrived there and obtained the blessed visitation(ziyarah) of his Spiritual Guide and Teacher (Pir-o-Murshid), Khwaja Mohammad Qasim Sadiq Mohrvi.\nAllah knows best, but during the long travel or perhaps for some other reason, Ballor Khan forgot to present the offerings as previously requested by Khwaja Ghulam Mohiuddin Ghaznavi. Eventually, Khwaja Qasim Mohrvi addressed him specifically, saying: “Along your travels, a businessman from Ghazni gave you some money as a gift for me. Why have you not yet honoured that trust?” Immediately, Ballor Khan remembered the request and presented Khwaja Ghaznavi’s offering whilst also passing on his salam with great humility and grace, to which Khwaja Qasim Mohrvi replied: “Son, when you return home, tell that merchant (i.e. Khwaja Ghaznavi) that I do not require his offerings, I require him.’”\nAfter the Urs Mubarak event of Mohra Sharif, Ballor Khan returned home and delivered Khwaja Qasim Mohrvi’s message to Khwaja Ghaznavi. This message of love and affection intensified the yearning in Khwaja Ghaznavi’s heart to meet the great Shaykh. It is indeed true that: “Nahin hein ishq mohtaaj e ziyarat, ye dolat haasil e guftaar bi hein.” (Meaning: Love is not dependant upon seeing [someone], this wealth is attainable just from one’s speech.)"
        },
        {
            "title": "12. Summoning through a Dream",
            "content": "Khwaja Ghaznavi, prior to receiving this message from Khwaja Qasim Mohrvi, had a dream one night. He saw that a buzurg (or a pious Shaykh) appeared, with a radiant face, immense stature and great beauty, who said to him with a smile: “Son! Come to me – everything of yours is with me.” After this blessed dream, Khwaja Qasim Mohrvi’s message via Ballor Khan was more vivid to him, and breathed new energy into Khwaja Ghaznavi’s wish to meet him; there was a renewed desire in his heart to meet this esteemed saint of Islam.\nFor this reason, Khwaja Ghaznavi, may Allah’s Mercy be upon him, set out along with his fellow kinsman and companion, Pir Mohammad Ibrahim Sahib,with the intention of visiting Mohra Sharif for the next Urs Mubarak hosted under the esteemed leadership of Khwaja Qasim Mohrvi."
        },
        {
            "title": "13. First Visit to Mohra Sharif",
            "content": "For the occasion of the Urs Mubarak of Mohra Sharif, Khwaja Ghaznavi and Pir Mohammad Ibrahim Sahib prepared for their journey, and had gathered other companions and followers of Mohra Sharif from Poonch. This blessed and spiritual group embarked on their journey to Mohra Sharif from the famous area of Tararkhal. After their long days and nights of travel, from Azad Patan to the river of Jhelum, they reached the province of Punjab. From there, they reached the region of Murree where Mohra Sharif is situated."
        },
        {
            "title": "14. Acquiring Bayah",
            "content": "Eventually, Khwaja Ghulam Mohiuddin Ghaznavi and Pir Mohammad Ibrahim Sahib met the great Shaykh, Khwaja Qasim Mohrvi and both took bayah (or pledged their spiritual allegiance) at his blessed hands, entering into the esteemed Naqshbandiyya tareeqah. They then spent a few days in his blessed presence.\nAfter the duaa concluding the Urs Mubarak event, these two blessed personalities joined their group to obtain the Shaykh’s permission to return home, and to ask for his blessings and duaas for the prosperity of their business. To this, Khwaja Qasim Mohrvi responded: “Go, son; your store will do such business that customers from East and West will purchase from you.”\nHaving received this powerful duaa, Khwaja Ghaznavi and Pir Ibrahim Sahib returned home. The store did extremely well to the extent that their profits were much higher than their expenditure, and Khwaja Ghaznavi himself said: “When we returned from Mohra Sharif and started our business, Allah Most High, through our Spiritual Guide (Murshid)’sduaas, gave us so much income that thousands of other businesses at that time succeeded through ours.”\nDespite the immense wealth, prosperity and performance of the business, Khwaja Ghulam Mohiuddin Ghaznavi felt a sense of discontentment within his heart."
        },
        {
            "title": "15. Second Visit to Mohra Sharif",
            "content": "A year later, Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy eternally be upon him, attended the Urs Mubarak at Mohra Sharif again. After he and Pir Ibrahim Sahib had kissed the blessed feet of Khwaja Mohammad Qasim Mohrvi, may Allah’s infinite Mercy be upon them all, they both offered a hundred Rupees towards the Urs Mubarak.\nThree or four days passed in the presence of their Spiritual Guide, Khwaja Qasim Mohrvi, and they then decided to ask for permission to return home. Again, they requested for duaas for the prosperity of their business and Khwaja Qasim Mohrvi replied in the same way as he had done the first time, saying: “Go son, by Allah’s Grace and Generosity (Fazl aur Karam), your store will attract customers from East and West.”\nIn Khwaja Ghaznavi’s heart, he had thought that this year’s trade would be more lucrative than last year. However, upon returning home, the complete opposite occurred. On a daily basis, difficulties and problems would arise. He himself once said: “We could not understand where these issues developed from. We would work harder than before, and despite this, we could not overcome those difficulties. Eventually, within months, our business was affected so much that we were left with only 350 Rupees.”"
        },
        {
            "title": "16. Return to Ghazni",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi reports:\n“In the end, in our state of dire need, we both prepared to return to Ghazni and so, we gathered whatever wealth we had left and began our journey from Kashmir to Afghanistan.\nWhen we reached what is now known as Azad Pathan, I said to Pir Mohammad Ibrahim Sahib: ‘Only Allah knows when we will come back here again. Let us pay our last visits to our Spiritual Guide, Khwaja Pir Mohammad Qasim Mohrvi and do his ziyara.’ However, Pir Mohammad Ibrahim Sahib refused. I said: ‘I will absolutely visit Khwaja Pir Qasim Mohrvi and I will not return home [to Afghanistan] without seeing him.’ After crossing the bridge, I took a right on the road to Humree and Pir Mohammad Ibrahim Sahib took a left on the road to Rawalpindi. After a short while, I turned around and noticed that instead of going to Rawalpindi, Pir Mohammad Ibrahim Sahib had actually followed me. So I stopped where I was, and when he reached me, we both travelled to Mohra Sharif together.\nWhen we reached Khwaja Qasim Mohrvi, he smiled and said, “My wonderful son has arrived!” We thought to ourselves that Khwaja Qasim Mohrvi had been extremely generous to us and hoped that he would also make sincere duaa for us so that we could reach Ghazni safely. At that moment in time, all we had in our possession for the purpose of travel, food, shelter etc. were those 350 Rupees, which I had put into a pouch and wrapped around my waist.\nSo, in the presence of Khwaja Mohammad Qasim Mohrvi, I said: “Huzoor, as a result of my business, we will be returning to our home in Ghazni.” However, after a short while, Khwaja Qasim Mohrvi said to me: “Today, the langar (i.e. blessed food for the all those who visit the masjid or centre) of the darbar is running low today, so we will need your 350 Rupees.” I took the pouch off my waist, opened it and placed it on the seat of Khwaja Qasim Mohrvi. He then called the langar servant who was in charge and gave him the money, telling him to go to the market and buy the best flour, lentils and other items to feed the guests.\nWhen we saw the man leave with our money to buy items for langar, we became very upset, thinking “How will we reach home now?” Whatever we had with us to get us home had been taken away. In that state of worry and concern, we left the majlis (gathering) and my eyes were full of tears.\nAt this point, someone went inside and told Khwaja Mohammad Qasim Mohrvi: “O Shaykh! Your Ghazni mureed (follower, disciple) from whom you took money is outside weeping.” So Khwaja Mohammad Qasim Mohrvi called me inside, but even after the call, I did not go inside. He called me a second time and I still did not go inside. The third time, Khwaja Qasim Mohrvi said: “Go and ask him: why do you not come inside? I’ve been waiting for you for a very long time, and I’ve prepared such wealth for you – the vastness of that wealth, only I know and Allah knows best!”\nI reluctantly went inside, whilst in my heart I was thinking: “What else do I now have? All I have is this beautiful coat and I may even be asked to take this off too!” When I reached Khwaja Qasim Mohrvi, he read this thought in my mind and said: “Son! No doubt, this coat of yours is very beautiful and of great use.” Then he smiled and said: “Son, I have been waiting for you for a long time, and today I have been granted my wish. Do not worry about your 350 Rupees, because I have prepared a vast treasure for you and kept it safe for you; and the greatness of this wealth only I know, and Allah knows. For your store, I have prepared such stock that people will come from East to West!” Then he embraced me, and from that embrace, my spirituality awakened and I felt immense peace and tranquillity in my heart and mind.\nKhwaja Qasim Mohrvi then said: “You have absolutely no permission to return home. Everything of yours is here. Go to the langar kitchen and serve there, and feed the guests and serve them well.”\nAfter hearing the words of his Spiritual Guide, Khwaja Ghaznavi’s life changed. Anxiety and unrest were replaced with peace at heart and so, completely carefree from this world, Khwaja Ghaznavi became occupied in serving his Shaykh.\nAt this point, in Khwaja Ghaznavi’s mind, his Shaykh was his only thought. On his lips, his Shaykh was the only dhikr, and in his heart, his Shaykh was his only remembrance. On his tongue, his Shaykh was the only name – in fact, his entire being became about serving his Shaykh. And his state became as this verse illustrates:\nNa gharaz kisi se na waasta,\nMujhe kaam apne hi kaam se.\nTere dhikr se, teri fikr se, teri yaad se, tere naam se\nMeaning: I do not worry nor interfere with [the way of] others,\nMy work is mine and only mine;\n[It is dedicated to] your remembrance, your thoughts, your memory, your name.\nKhwaja Ghaznavi continues:\n“We travelled from Ghazni to Punjab for business, and we had heard a great deal about Khwaja Mohammad Qasim Mohrvi. Thus, we presented ourselves at the Ghawthiya Darbar of Mohra Sharif, and Khwaja Qasim Mohrvi made us part of his tareeqah. Once we took bayah, we left our business and served Khwaja Qasim Mohrvi for 12 years. We had no worldly desire and we acted upon the orders of our Shaykh, who had rekindled the truth of Allah’s tawheed in countless hearts.\nIn Ghazni and Gardez, our wealth, land and farms were so vast that if a person on a horse was to ride through it, he would return, with great difficulty, late in the afternoon [due to the immense scale of land]. However, at the words of our Spiritual Guide, we had to sacrifice everything; all of our wealth and riches. Truly, in reality, the first step of love is to sacrifice everything in Allah’s Way, because:\n“Tarke jaan o tark e maal, o tark e sar,\nDar tareeq e ishq awwal manz al ast.”\nMeaning: Sacrifice life, wealth and your head,\nAt the abode of love, this is the first step."
        },
        {
            "title": "17. At the Feet of His Spiritual Guide",
            "content": "Under the blessed guidance of Khwaja Qasim Mohrvi, Khwaja Ghulam Mohiuddin Ghaznavi was enlightened both in worldly and religious guidance, and Khwaja Qasim Mohrvi appointed him to be a helper in the blessed langar kitchen, saying: “Son, you do not have permission to go home. Go to the langar kitchen and participate in preparing food and feeding those that visit here.”\nKhwaja Ghaznavi narrates he spent approximately one month in the langar kitchen of Mohra Sharif and one day, Khwaja Qasim Mohrvi called him and said: “Son, from today, you are in charge of langar. Erase any thoughts of home and family from your heart.” Accordingly, Khwaja Ghaznavi, may Allah’s Mercy be upon him, followed this command of his Shaykh in such a way that till the end of time and throughout the world of tasawwuf (Sufism), it is an unparalleled example which will shine resplendently for those seeking guidance.\nThoughts of family, friends and his beloved homeland were no longer in his heart, and he treasured tasawwur-e-Shaykh (the concept of focusing on one’s Shaykh) in such a way that his heart and vision became like this:\nNaqsh esa jama diya tu ne,\nDil se sab kuch mita diya tu ne.\nMeaning: You have drawn such a map that,\nIn my heart, everything else has been forgotten.\nAt the age of 22, Khwaja Ghulam Mohiuddin Ghaznavi went to Mohra Sharif, and at the age of 72, he passed away from this world. During these long 50 years, he never thought about home, friends or family or his beloved hometown. During his whole life, he followed the well-known saying of many saints, “Al mureedu malla yureedu”.\nOne time, Khwaja Ghaznavi asked Khwaja Qasim Mohrvi, “Back in Ghazni, it has been arranged for me to marry the daughter of my uncle. Our tradition there is that we cannot reject this proposal unless we are dying, therefore please grant me permission to go home so I can participate in this joy.” Khwaja Qasim Mohrvi said, “Son! I have not made you dependant upon anyone, and regarding marriage, I have ensured that you do not need to go to anyone. You do not have permission to go home.”\nSeveral days later, Khwaja Saani Sahib (brother of Khwaja Ghaznavi) returned to Afghanistan from Mohra Sharif and told their uncle and other family members that Khwaja Ghaznavi will be married to their uncle’s daughter but at Mohra Sharif. In this way, Khwaja Qasim Mohrvi’s instructions were followed and Khwaja Ghaznavi was married under the spiritual guidance of his Shaykh."
        },
        {
            "title": "18. The Time Has Not Yet Arrived",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, narrates that he had been in charge of the blessed langar at Mohra Sharif for a while, when he began the practise of approaching Khwaja Qasim Mohrvi for permission to serve the langar every time it was ready. This he did by writing a note to the Shaykh, and towards the end of each note, he would write: “Why will you not grant me my part in wilayat (sainthood)?”\nThis is because Khwaja Qasim Mohrvi, may Allah’s Mercy be upon him, had initially said to Khwaja Ghaznavi: “I have secured for you a great treasure, of which the value and splendour is known only by Allah.” For this reason, Khwaja Ghaznavi used to request this spiritual treasure in his daily note. Khwaja Ghaznavi narrates that his practise of making this specific request on a daily basis went on for 4 years continuously, without any response from Khwaja Qasim Mohrvi.\nThen, Khwaja Ghaznavi narrates that after 4 years, one day Khwaja Qasim Mohrvi called him at around 12 or 12:30 in the afternoon. When he made himself present before Khwaja Qasim Mohrvi, the Shaykh said to him: “Son, the petals from a rose emit more fragrance when they fall naturally than when they are cut off. Thus, when they fall naturally in their own time, their smell and fragrance is increased.” Khwaja Ghaznavi narrates that he remained silent at this statement out of respect and was unable to respond. Khwaja Qasim Mohrvi repeated this a second time, and again, he was unable to respond. When Khwaja Qasim Mohrvi repeated this for the third time, Khwaja Ghaznavi affirmed: “Huzoor, indeed the petals of a rose do smell wonderful and emit more fragrance when they have naturally fallen in their own time.” To this, Khwaja Qasim Mohrvi replied: “Then why is it that you hassle me daily?”\nKhwaja Ghaznavi narrates that in his heart he thought to himself that he had done nothing to trouble his Shaykh’s heart other this daily request, and immediately understood his gentle gesture regarding this matter. Thereafter Khwaja Ghaznavi completely put an end to this practise.\nKhwaja Ghaznavi relates that during his stay in Mohra Sharif, they always worked in the langar kitchen and treated guests and visitors with such respect that none would see any lapse in their duties. Their selflessness was to the extent that they had no care for their own meals; they would not eat until all the guests had finished eating. After all the visitors had been fed, they would go to Khwaja Qasim Mohrvi and ask: “Huzoor! All the guests in the darbar have been fed.” To which, the Shaykh would enquire: “Sons, have you also eaten?” They would respond: “We have not eaten yet.” The Shaykh would reply: “Go, you also eat.”\nSometimes, there would be nothing left for them to eat but in accordance with the way of their Shaykh, they would become indifferent to their hunger and would not bring it to mind."
        },
        {
            "title": "19. Etiquette of the Abode of One’s Shaykh (Pir Khaana)",
            "content": "Spiritual masters of tareeqah (the Sufi Path) narrate: “Al tareeqatu kulluha adabun”, meaning tareeqah is entirely etiquette (adab refers to etiquette, respect, reverence).\nThe life and times of Khwaja Ghulam Mohiuddin Ghaznavi were full of etiquette and reverence for his Shaykh, even though he was very close to him and well-loved by him. He was very steadfast in his respect and love for the abode of his Shaykh. He would say, no matter how close you are to your Shaykh of tareeqah, you should always show reverence towards him accordingly. He says: “During 12 long years in the abode of my Shaykh, I never broke my wudhu but I would go outside the boundaries of Mohra Sharif to attend to the call of nature.”"
        },
        {
            "title": "20. Restlessness of Loved Ones",
            "content": "During Khwaja Ghulam Mohiuddin Ghaznavi’s first 4 or 5 years in Mohra Sharif, he did not keep in contact with anyone at home, being concerned that any thought or contact with home might result in a lapse in serving his Murshid (spiritual guide or Shaykh). In Ghazni, his father, mother, sisters and brothers were unaware of his health and well-being and became growingly concerned. Sometimes passers-by, on their way back from Mohra Sharif, would tell them that Khwaja Ghaznavi and Pir Ibrahim Sahib were in Mohra Sharif in Rawalpindi, but the family did not receive any further news to satisfy their worries.\nEventually, his parents and loved ones sent the younger brother of Khwaja Ghaznavi, Khwaja Mohammad Durrab Khan (also known as Pir Saani Sahib) to look for him in Punjab, India – may Allah be well pleased with them both. Khwaja Pir Saani Sahib searched all over Ghazni before reaching Rawalpindi, and from there he proceeded to Mohra Sharif. There, he met his older brother Khwaja Ghaznavi and the two long-lost brothers embraced. Then Khwaja Pir Saani Sahib presented himself before Khwaja Qasim Mohrvi, and having seen the pure radiance of this fountain of sainthood, sacrificed his heart and mind [for this sacred Path]. Khwaja Pir Saani Sahib then took bayah by placing his hand in the hands of his blessed Shaykh, and became his servant since.\nAaye the shikaar karne ko,\nShikaar ho ke chale!\nMeaning: He came hunting,\nYet he himself was hunted.\nKhwaja Pir Saani Sahib went in search of his brother and in the end, he himself cleansed his hands [in the way of tasawwuf]. In this way, Khwaja Pir Saani Sahib and his brother, the unparalleled Khwaja Ghulam Mohiuddin Ghaznavi, remained in the presence of Khwaja Qasim Mohrvi and they devoted themselves to serving at the darbar day and night.\nIn the blessed langar kitchen, all the service (khidmat) was done by these three blessed people: Khwaja Ghulam Mohiuddin Ghaznavi, Khwaja Pir Saani Sahib and Pir Ibrahim Sahib."
        },
        {
            "title": "21. A Story",
            "content": "Khwaja Pir Saani Sahib once narrated the following to the author (Khalifa Riaz Ahmad Samdani):\nOne time, as usual, they had fed all the visitors and well-wishers of Mohra Sharif and then presented themselves in front of Khwaja Qasim Mohrvi. Khwaja Qasim Mohrvi said, “Sons, have all the guests been fed?” They responded, “Yes, sir.” The Shaykh asked, “No one has been left hungry?” They replied, “Everyone has eaten and no guests have been left unfed.” The Shaykh responded, “One man has not been given any food. Go, and make sure he is fed.”\nSo they went to all of the guests and well-wishers and asked them: “Is there any amongst you who has not yet eaten?” However, despite their search for this person, they were unable to find him. Eventually, in despair, they went back to the esteemed Shaykh, Khwaja Qasim Mohrvi and said, “Huzoor, we could not find the person who has been left unfed.” Khwaja Qasim Mohrvi responded, “Sons, on the masjid floor there is a man who is asleep and has not been fed. And indeed, he has been left hungry. Go and feed him from the langar.”\n(Khwaja Pir Saani Sahib continued) they proceeded to the masjid and found a person sleeping, who had fully covered himself in a piece of carpet. They awakened him and asked, “Why are you hidden here, asleep? And why have you not eaten langar?” He answered, “Because I am a Hindu, and I did not want to eat food made from your hands. I only wanted to spend the night here, which is why I have been hiding here asleep.”\nSo they returned to Khwaja Qasim Mohrvi and said: “That person is a Hindu and does not want to eat food made from our hands.” Khwaja Qasim Mohrvi replied: “From the langar kitchen, give him some dry flour and from the langar kitchen, give him a separate bowl for Hindus so he can make his own food. To this day, no one has slept with an empty stomach in my presence.” According to this noble command, they then gave the Hindu man dry ingredients for his food, some drink and a bowl. When the man had made his own food and had finished eating, Khwaja Qasim Mohrvi said, “Now my heart is at peace and tranquillity.”"
        },
        {
            "title": "22. Obtaining Khilafat (Becoming a Deputy)",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi, may Allah be well pleased with him, spent 12 years in the presence and service of his Shaykh. When he reached the Status of (Spiritual) Perfection (darja-e-kamaal), he was put through the furnace of asceticism (riazat) and internal struggle (mujahada), until he emerged as a precious jewel. After having endured those 12 years of isolation (chila), he attained purity, peace of heart and soul, and true satisfaction.\nHis Shaykh, the noble Khwaja Qasim Mohrvi, may Allah be well pleased with him, granted him the attribute of khilafat (to become a deputy) in every aspect. For the creation of Allah, he made him a beacon of spiritual encouragement, guidance, representation of Divine Commands (khilafat-e-Ilahia), and the propagation of Islam.\nKhwaja Ghulam Mohiuddin Ghaznavi, Khwaja Pir Saani and Pir Ibrahim Sahib all gained khilafat in Silsila Aalia Naqshbandiyya at the same time, and were given the command to be based in the region of Kashmir, in the famous area of Tararkhal where they would preach the spiritual guidance of Inner and Outer Realities (zaahir-o-baatin) to the creation and the Ummah of Sayyidina RasulAllah, peace and blessings of Allah be upon him. They were also commanded to go from town to town and village to village propagating Islam, and through this medium, bring people out of darkness and ignorance and rid them of shirk (associating others to Allah).\nKhwaja Ghulam Mohiuddin Ghaznavi narrates that they requested their Shaykh to allow them to return to Ghazni, Afghanistan, so they could begin to act upon these commands. However, Khwaja Qasim Mohrvi did not grant this permission, and instead told them that it was not Afghanistan but Nerian in Tararkhal where they needed to go. The Shaykh continued that in this place, Allah had brought Afghanistan to Nerian Sharif as though it was always there, and Pathans (people of Afghanistan) from the entire region would reach Nerian Sharif, enter into the Silsila Naqshbandiyya and would serve them with their hearts and souls."
        },
        {
            "title": "23. Arrival to Nerian Sharif",
            "content": "Khwaja Qasim Mohrvi instructed his son (of the same spiritual excellence), Qibla Pir Zaid Khan Sahib, may Allah’s Mercy be upon them both, to go to the region of Poonch to the jungle of Nerian and build a small hut. The noble Khwaja Pir Zaid Khan Sahib, following his Shaykh and father’s orders, took Khwaja Ghulam Mohiuddin Ghaznavi, Pir Saani Sahib and Pir Ibrahim Sahib to the jungle of Nerian and built a very simple house from tree roots, and gave Khwaja Ghulam Mohiuddin Ghaznavi the task of spiritual guidance of the people of Kashmir. Khwaja Pir Zaid Khan Sahib, as instructed, put up a white flag (on this house) and said, “Keep this spiritual and enlightened flag up high, and never let it fall.”"
        },
        {
            "title": "24. Early Days at Nerian Sharif",
            "content": "Before Khwaja Ghulam Mohiuddin Ghaznavi had arrived, this area which is today well-known throughout Pakistan and Kashmir by the blessed name of Nerian Sharif, was known as ‘Danna Pothi Meer Khan’. Approximately 50 years ago, this was a dangerous jungle, with rough terrain and was a sparse area. There were no facilities for human comfort. Roads were unknown and treacherous, with run-down houses, small pockets of inhabitants within the mountains, icy winds, cold breezes and extremely desolate areas. Khwaja Pir Zaid Khan Sahib by the instruction of Khwaja Qasim Mohrvi, with his arrival and the spiritual grace (fayz) of Mohra Sharif, turned this area from a dark region to one which became crowned with unparalleled greatness. Allah Most High knows what that dark jungle possessed and which of its qualities and features were liked by Him; such that He made this area the centre of thousands of followers’ belief (aqeeda) and love (muhabbat), and made it a station of spiritual enlightenment and blessing for His accepted and beloved Servant, Khwaja Qasim Mohrvi, may Allah’s Mercy be upon him.\nToday, that area is a spring of teaching and guidance, not just for Jammu Kashmir, but for the whole of Pakistan and Afghanistan, and people from far and wide are being spiritually graced. Actually, Khwaja Qasim Mohrvi’s spiritual vision had been waiting for a long time for this spiritual rise, which then became the objective of Khwaja Ghulam Mohiuddin Ghaznavi and which then proceeded to promote the propagation of Islam and its Way. Projects of unimaginable scale began, which became towers of Light for the people of tareeqa and will always guide those lost in the despair of this world.\nThere was a time when no human would even mistakenly visit this region. Today, nobody passes through without visiting to pay their respect to the blessed personalities (burzurg) resting there. Here there were once wild animals, and due to the thorny trees, it was a barren land. Today, every second is filled with the recitation of Allahu and La ilaha illallah Muhammadur RasulAllah; tawheed and risalat, dhikr-e-Mustafa, are the sounds now ringing in the area today, and to quote Mawlana Jami:\nKhushaN masjid-o-madrasa-o-khanqa he,\nKe darwe buud keel e kaal o Muhammad (sallallahu alayhi wa sallam)!\nMeaning: Wherever there are masjids, madrasas or darbars,\nThat is where you will hear of the sayings and life of Muhammad, peace and blessings of Allah be upon him!\nThis very privileged region now has strong buildings, guest rooms, masjids and darbars, and these all lead to one great masjid which is today like a beacon. During the night, it is lit up with generator-powered electricity using tube lights which make it stand out in the darkness.\nChaman mein phool ka khilna to koi baat nahiN,\nZahe wo phool jo gulshan banaye sehra ko.\nMeaning: In a garden, it is no big deal for a flower to bloom,\nBut better than that is a flower which turns the sky into a garden!"
        },
        {
            "title": "25. Various Periods of Khwaja Ghaznavi’s Life",
            "content": "Upon arrival at Nerian Sharif, the life of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, experienced a new beginning in such a way that it became categorised into three main periods:\nThe first period is from his birth to when he was around 20 to 22 years of age, in which were his childhood, education and upbringing, plus his journey from Ghazni to India, and India to Punjab.\nThe second period begins with the starting of his business and his life in Punjab and Kashmir, and then leads to his attainment of bayah followed by 12 years of khidmat (service) at Mohra Sharif. This period lasted for 14 to 15 years, and it is during this period that his life underwent a great spiritual transformation.\nThe third period is his attainment of khilafat and his life in Nerian Sharif, until he departed from this world.\nThe first two periods have been briefly narrated in the previous sections, and the upcoming sections will focus on the third period of Khwaja Ghulam Mohiuddin Ghaznavi’s life.\nThe third period of Khwaja Ghaznavi’s life was one of immense virtue and achievement, during which he carried out the propagation of Islam and delivered guidance through Shari’ah and tareeqah. He did this in such a way that the effects of his fayz and blessings shall now remain forever."
        },
        {
            "title": "26. Trials and Tribulations",
            "content": "Just as the propagation of Islam is full of blessing and greatness, it is also full of obstacles and challenges. In essence, it is the work of the Prophets of Allah, may Allah’s peace be upon them all, as this is a duty more beloved to Allah Most High than all other good deeds and virtues. For this reason, Allah Most High has granted the children of Adam a line of highly esteemed Prophets who were chosen to propagate Islam, and after our Beloved Prophet, may Allah’s peace and blessings be upon him, this duty was passed on to the awliya Allah (Friends of Allah, or saints).\nSayyidina RasulAllah has said, as reported in Mishkat Sharif, “The scholars of my Ummah are like the Prophets of Bani Israel.” And, “The divine scholars are the successors of the Prophets.”\nThese narrations of Sayyidina RasulAllah point us to the reality that the scholars and awliya of the Ummah are indeed the successors of the Prophets before us, and are the successors of the propagators of religion. This is why such sacred personalities are presented with extreme difficulties when propagating Islam, where unmentionable circumstances and extreme challenges are overcome. In such circumstances, this beloved duty to Allah is not achievable for all, but is the duty of those who have strong motivation. Khwaja Ghulam Mohiuddin Ghaznavi too took this duty upon himself but it was not without many challenges and trials.\nAccordingly, the beginning of the era at Nerian Sharif was that of a poor region, with an unknown environment and many political agendas. Despite this, Khwaja Ghaznavi upheld the duty of prppagation with immense determination and strength, striving through the difficult times. It must be said that this Man of Truth (mard-e-haqq) rose to such heights that even the storm of opposition were helpless before him, and many of the opposition changed their individual ways to become a means of [this] success and elevation.\nDuring this period, Khwaja Ghaznavi, may Allah’s Mercy be upon him, experienced and overcame great hardship. He was subjected to many trials and tribulations in this dangerous jungle but in accordance to the instructions of his Shaykh, his way was that of patience and gratitude. He sat in this poor and desolate region and began the way of propagation (tableegh) night and day. The extreme times and the strength of his opposition were unable to bring tears to his eyes:\nHawa hai go tund o tez,\nLekin charaagh apna jala raha heiN,\nWo mard-e-dervesh jis ko haqq ne diye heiN andaaz e khusrowana\nMeaning: The wind may blow strong and cold,\nYet his lantern will continue to burn bright,\nThat dervish whose character of virtue has been granted by the Truth (Allah)\nThis is not only the path of aqeeda but also a true reality. In Nerian Sharif, Khwaja Ghaznavi’s entire wealth is today a masjid and madrasa, darbar with guestrooms, as well as various houses for the servants (khadimeen or khuddaam) of the great darbar. Furthermore, even to this day, as a result of his fifty years of propagation and spiritual life in the way of Islam, no one in the region of Nerian Sharif has ever gone hungry. Without hesitation, the rich and poor, the known and unknown, are all served from the blessed langar. There have been times where the beloved Khwaja Ghaznavi would even sell his own clothes and provisions at home to be able to feed the guests."
        },
        {
            "title": "27. A Couple of Stories",
            "content": "• There was a time when some guests were visiting and there was no food with which to serve them. A mureed from Kabul had once given Khwaja Ghulam Mohiuddin Ghaznavi a valuable longhi (a garment worn around the waist reaching up to the feet) as a gift. That day, Khwaja Ghaznavi was wearing this longhi, so he took it off and gave it to a khaadim, ordering him: “Take my longhi to the market of Tararkhal and buy food for these guests.”\n• Once time, Khwaja Ghaznavi spent eight or nine months on the road propagating Islam, leaving his family in the Protection of Allah Whose Cause he was serving. He had no money and nobody was willing to lend him any as they knew he did not have anything to pay them back with. It is true that thefuqara (or ascetics) keep nothing with them except for the term “La ilaha illallah.” People at this time had been waiting for a famine to end. When Khwaja Ghulam Mohiuddin Ghaznavi returned after eight or nine months, he saw how his family had been affected by the famine. His children were now happy, hoping that with his return, there would be food in the house and they would be able to eat. Khwaja Ghaznavi put his hand in his pocket and took out ten or eleven Anna (old Indian currency), and felt he needed to also visit his beloved Shaykh and present his Shaykh with a gift – however, these ten or eleven Anna was all he had. If he was to buy bread and lentils for his children with this money, what would he present in the courts of his Shaykh? Half the night had passed by with these thoughts in his mind.\nIn the end, he decided in his heart that his children are in Allah’s Protection and so before dawn, and before the children had woken up, he set off for Mohra Sharif. As soon as it was morning, the children woke up very happy thinking they would be able to eat today, but when they found out that Khwaja Ghaznavi had set off for Mohra Sharif, their hopes were ruined.\nA day before Khwaja Ghaznavi reached Mohra Sharif, a man from Tararkhal went to the presence of Khwaja Qasim Mohrvi, who asked: “How is my Ghazni khalifa?” – referring to Khwaja Ghaznavi. That man replied: “Within two or three days, you will hear the news that his children have died from hunger.” On the second day, Khwaja Ghaznavi reached Khwaja Qasim Mohrvi’s darbar and that man, as coincidence, was also in Mohra Sharif when Khwaja Ghaznavi met Khwaja Qasim Mohrvi. Khwaja Qasim Mohrvi asked him: “Son, how are your children?” Khwaja Ghaznavi replied: “Alhamdulillah, by your prayers, they are fine.” Then Khwaja Qasim Mohrvi looked towards that man, and said: “Child! You had told me that within two days, the children of my Ghazni khalifa would pass away. But he says that by the Grace of Allah, they are alive and well.” Khwaja Ghulam Mohiuddin Ghaznavi says: “I witnessed this conversation, and I thought: People are now wondering and awaiting news of our demise due to hunger! Then I had a sudden surge of energy so without any delay, I said: “Hadhrat, how is it that someone is your khalifa yet people fear that they might die from hunger – this is impossible!” These words left my mouth in such a way, that Khwaja Qasim Mohrvi immediately raised his blessed hands in duaa, and said: “Go son, from today, the world shall eat from your langar!”\nSince this duaa, everyday whether day or night, tens of thousands of people eat langar in the blessed darbar of Nerian Sharif. It is Allah Most High’s Grace and Bounty, and the sacred foresight of Khwaja Qasim Mohrvi, that never again has there been a shortage of food. Sometimes when the area suffered from a shortage of corn, people knew that the langar of Nerian Sharif was still ongoing, and in these situations, the poor and needy in the area would sit at the dastar khan (dining cloth) of Nerian Sharif, day and night.\nMawlana Jami says:\n“The Naqshbandiya lead an extraordinary caravan,\nFor they take their students to the Haram (sanctuary) via a secret, hidden route.”"
        },
        {
            "title": "28. Physical Appearance and Lifestyle (Surat o Seerat)",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, was of medium height, and he was well-built with a medium frame. His arms were strong and muscular, and the colour of sugar cane. He had a radiant and broad face, resplendent forehead and beautiful eyes, and he had a thick beard which reached up to his chest in accordance to the Sunnah. His wide chest was a treasury of Divine Secrets. He was highly dignified, having extreme courage and a strong aura. Although he had an awe-inspiring and even intimidating presence, he possessed a heart-warming character and appearance."
        },
        {
            "title": "29. Clothing and Attire",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi wore white elegant yet simple attire, which consisted of salwar kameez. Initially he used to wear an imamah sharif (or Islamic turban) but afterwards, as a form of respect and humility, he would instead simply wear a chaadar (cloak) over his head. He had a black waistcoat and a black jubba (a long shirt up to the knees). During warmer days, he would sometimes wear a black waistcoat and a white scarf. He was against wearing clothing that was difficult to manage. He would use a lot of ‘itr (perfume) and his personality encompassed humility and sincerity. The Shaykh was very thoughtful and pious, and wore the spiritual clothing of asceticism (riazat) and self-discipline (mujahada)."
        },
        {
            "title": "30. Great Personality (Akhlaaq e Kareemana)",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, would meet everyone with immense affection. He would ask about their well-being, their name and where they had come from, resulting in strangers warming to him. The Shaykh would listen to everyone with full attention, whether they were known to him or not, and their questions were always answered with a sincere response. Inevitably, whoever presented themselves in his court was showered with his fayz (grace) and blessings, regardless of their individual status. Whether they were his own or not, familiar or strangers, he dealt with them cheerfully and with great generosity. The Shaykh was extremely fond of guests and loved to host them. He would personally ensure the arrangements of their meals. In regards to khidmat-e-khalq, or serving the creation, he would take great pleasure and perform this with much humility. Khidmat-e-khalq is one of the main principles and attributes of the people of tareeqa. Actually, the people of tareeqa titled the act of serving people and embracing them with affection and generosity as tareeqa itself.\nTareeqat bajuz khidmat e khalq nest,\nBa tasbee o sajda o dalq nest\nMeaning: There is no tareeqa without khidmat-e-khalq,\nIt is not counting beads, sitting on the mat or wearing tatters\n[Shaykh Saadi]\nKhwaja Ghulam Mohiuddin Ghaznavi’s blessed personality is full of this great attribute. The author (Khalifa Samdani) relates the following: I went to Nerian Sharif to meet Khwaja Ghaznavi. At that time, Darbar Nerian Sharif was in the process of being refurbished. The Shaykh sat in one of the guest rooms, and the afternoon langar had already been served. The Shaykh got up and went inside his house. After a while, he came out and for me, he had bread in one hand and curry in the other. Due to physical weakness, his hands were shaking. I saw this and was extremely shocked, and immediately took the plate and food from his hands. When I witnessed this scene, the saying “Tareeqat bajuz khidmat e khalq nest…” was shown to me in its reality."
        },
        {
            "title": "31. Reverence of the Scholars",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, treated the scholars of Islam with immense respect and honour. During Islamic gatherings (mehfil), he would seat them near himself and would personally look after them and their needs. He was not only like this with scholars who were in his favour; if a scholar who opposed him day and night went to visit him, that scholar would never experience any hostility or awkwardness from him, and onlookers would not notice that there was any opposition at all. Instead, that person would be so affected by this great personality of Khwaja Ghaznavi that they would immediately feel ashamed within their hearts for harbouring any ill feeling towards him."
        },
        {
            "title": "32. Pleasant Character with Enemies",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, would never speak about his enemies and opposition. He would never mention their names or their words of complaint. In very rare cases, if he did mention one of his enemies, he would do so in good words and with fond memories. People around him would listen to this and be surprised in their hearts, that: “so-and-so would spend day and night opposing and ridiculing Khwaja Ghaznavi but the Shaykh is speaking about them in the best possible way!” When this characteristic would reach his enemies/opposition, they would feel shame within their hearts. Khwaja Ghaznavi would never take the words of his enemies and opposition personally. Here, we can quote Shaykh Saadi Shirazi for Khwaja Ghulam Mohiuddin Ghaznavi had such a personality:\nZe tasnee’e yaara nabashad khabar,\nKe gharke na daarad zabaara khabar\nIf any person bearing enmity against Khwaja Ghaznavi entered his presence, or somehow had the privilege of meeting him, they would experience the Shaykh’s beautiful character (husn-e-akhlaaq), reverence and hospitality; as a result, they would be dedicated to serving him for the rest of their life. In this way, there are numerous stories which show his beautiful personality and mannerisms."
        },
        {
            "title": "33. Steadfastness upon Truth (Istiqaamat alal Haqq)",
            "content": "It is said by the pious: “Al istiqaamatu fawq al karamah” i.e. remaining steadfast upon the Truth is more superior than miracles. They also say: “Al istiqaamatu afdhalu min alfi kiramah,” i.e. remaining steadfast is more superior than a thousand miracles.\nKhwaja Ghulam Mohiuddin Ghaznavi’s wonderful character was laden with the attribute of istiqaamat (remaining steadfast). He was steadfast upon the Shari’ah and sciences (usul) of respect and tareeqah, which were instilled within his blood and veins. Whilst fulfilling the duties of tareeqah, he maintained his Fardh (obligatory), wajib and mustahabaat (recommended) acts, and strongly disliked when people would neglect these.\nHe was always in a state of wudhu (ritual purification), even in times of extreme cold and on snowy nights, he would awaken, immediately perform wudhu and go back to sleep. From his daily five salah, never did one become qazaa (late). He once narrated that he believed it was a gift that since the day Khwaja Qasim Mohrvi bestowed khilafat upon him, he was never without wudhu except if his wudhu broke, he would immediately go and renew it. Since receiving khilafat, he never missed a single salah."
        },
        {
            "title": "34. Daily Activities",
            "content": "The days and nights of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s mercy be upon him, were spent in exactly the same manner, whether he was travelling or not. When in his blessed residence, he would sit with the visitors and meet them and deliver religious counsel. There was a specific area designated for this, and after performing Ishraq prayer, he would sit at his place there; the visitors and those serving (khuddaam) would then meet and embrace him. Newcomers were met with a close heart-warming embrace. After meeting Khwaja Ghaznavi, they would all take part in Khatam-e-Khwajagaan and the guests would sit quietly in respect, awaiting his words. After the Khatam-e-Khwajagaan, everyone would raise their hands for duaa during which Durood-e-Taj was also recited. During the duaa, Khwaja Ghaznavi would become emotional and humble, and our Beloved Prophet says: “Ad-duaau mukhkhul ibaadati. (Duaa is the brain of worship).” In that way, this blessed saying of Sayyidina RasulAllah manifested in the sight of the Shaykh’s guests who would also become tearful. After duaa, all the attendees and guests would drink tea together. This routine continued until early afternoon, with guests coming and going continuously.\nPeople would come with their religious and worldly troubles and news, and to request the Shaykh’s opinion and/or advice. Spiritual and bodily illnesses would be alleviated by his duaa. He would pray for the relief of people’s tribulations, wishes and problems in the Court of Allah Most High, and would preach to people about steadfastness towards the Commands of Shari’ah, piety and virtue. This routine of tableegh or propagation and advice would continue until early afternoon. After this, langar sharif would be served and the dinner cloth (dastar khan) would be laid out in front of everyone who would then be fed. The Shaykh would often sit with the guests and eat with them. After everyone had eaten, he would return home to his children and if he wanted to eat, he would do so with his children. Otherwise, any womenfolk who wished to meet him would have the opportunity then, and he would pray for them. After this, he would rest for 30-45 minutes, then wake up and perform wudhu for the Zuhr prayer. As soon as the adhaan was completed for Zuhr, he would leave his blessed residence and proceed towards the masjid [connected to the darbar itself] to participate in congregation (Jamaat). After prayer, he would return straight to darbar sharif and sit in his seat to honour the guests and attendees with his presence. This routine would last until ‘Asr prayer. If he required fresh wudhu, he would go and renew it otherwise he would stay seated. As soon as ‘Asr adhaan was delivered, he would go to masjid and perform his sunnat, and then join the congregation for the fardh.\nAfter this, he would sometimes stay seated in the masjid until Maghrib and perform his own tasbeeh and waza’if (litanies, also known as awraad) while guests and attendees would seat themselves around him in a circle. Otherwise, he would usually return to the darbar sharif to his seat and finish his tasbeeh and waza’if there. As soon as Maghrib adhaan was delivered, he would head to the masjid to perform prayer with the congregation, and as soon as the congregational prayer had finished, he would quickly return to the darbar sharif and would ask his close servant (khaadim) to close the door. He would then perform the remaining sunnat and nafl, and then perform Awwabeen prayer. Then he would sit in his seat and revise books relating to Hadith and Tafsir for roughly 30-45 minutes. During this time, the darbar sharif door would be closed and one servant would be on standby in case he needed anything. Guests and attendees were kept occupied in the masjid by the Imam leading halqa-e-dhikr (circle of dhikr). By the time dhikr had finished, Khwaja Ghulam Mohiuddin Ghaznavi would have completed his routine. The darbar sharif door would then reopen, and visitors would be able to sit with him and eat.\nDuring his elderly age, he would perform the Fajr and Isha prayers at home, and the other three prayers in the masjid. During his travels for the sake of propagation, Khwaja Ghaznavi would spend his days in more or less exactly the same way. During this time, his nights and days were spent delivering speeches more often, and halqa-e-dhikr was performed three or four times daily. Whether travelling or at home, he would never spend more than 2 or 3 hours resting. In this way, he would also follow Sayyidina RasulAllah’ssunnah of sleeping. He would often say: “I would stop sleeping if it wasn’t for the sunnah of Sayyidina RasulAllah; I sleep only to receive the reward of fulfilling this sunnah.” He would spend time reciting the Qur’an, performing nawafil (voluntary worship) and the Tahajjud prayer, reciting tasbeeh and duaa. During these late hours, he would often be in the state of contemplation and reflection to the extent that he would become unaware of who he was and where he was at that time. These periods are best summed up with the words:\nMeiN taalib tera, tu matlub mera\nMeaning: I am searching for You, You are the One I am seeking.\nSometimes he would be in such a state of contemplation and reflection that he would spend 30 minutes to an hour in this state. Just before dawn, he would perform the Tahajjud prayer, followed by Fajr prayer, followed by the Ishraq prayer."
        },
        {
            "title": "35. His Promotion of Islam & Teachings",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s mercy be upon him, went to Nerian Sharif in accordance with the commands of his Shaykh, Khwaja Pir Mohammad Qasim Mohrvi. He immediately began to spend his days and nights in promoting the deen, leading people in spiritual training, and reforming the inner and outer states of these creations of Allah and ummah of Sayyidina RasulAllah, peace and blessings of Allah be upon him, to correct their ways and characters.\nThe regions of Kashmir, Suba Sarhad and Punjab were part of his tour for conveying the message of Islam, and these became part of an enlightened and spiritual routine, during which the days were spent with speeches and Islamic propagation and the nights were spent in the dhikr of Allah Most High. Such times and schedules of tableegh (propagation) continued for years. He would spend many days travelling through treacherous mountains and wherever he went, he would teach people the Kalima Tayyibah (declaration of faith). After teaching them this, he would convey to them the way of prayers, fasting and the Commands of Allah and Sayyidina RasulAllah.\nAt the start, his propagational tours would mainly take place in Jammu Kashmir. This is because Khwaja Qasim Mohrvi had made it a priority specifically for Khwaja Ghaznavi to guide the people of this region. It is for this reason that Khwaja Ghaznavi first propagated Islam throughout this region, after which he went to Punjab, Jhelum, Rawalpindi, Kimbalpur, Suba Sarhad, and the tribes of these areas also took advantage of this enlightening propagation. Over time, the whole of Punjab, Sindh, Karachi, Hyderabad and all other areas of Pakistan far and wide drank from the fountain of his propagation and fayz (spiritual grace)."
        },
        {
            "title": "36. Blessings of His Propagational Journeys",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi’s spiritual tours, may Allah’s Mercy be upon him, were of immense blessing and grace (fayz) during which, regardless of which area or village he visited, he showered the people with valuable knowledge of the seen and Unseen. Unseen and spiritual blessings were such that wherever he stayed, people would automatically approach his circle of education (dars) and gatherings of dhikr.\nThose who would sin openly (faasiqs), who would betray Islamic laws (faajirs), would not perform their salah and were ignorant about Islam would take bayah at his blessed hands, vowing to fulfil their salah obligations and live their lives according to Shari’ah and sunnah.\nFrom Khwaja Ghaznavi’s gatherings of teachings, speeches and dhikr, people’s hearts were set alight with a passion for Islam and a yearning to fulfil righteous actions (aamal-e-saaliha), and as a consequence, those who were once ignorant to Islam saw their lives completely transformed. These same people became pious, steadfast in their salah and were esteemed in rank. With these spiritual transformations and blessings, wherever Khwaja Ghaznavi’s noble feet passed, those regions were showered with the blessings of Allah and prospered in terms of finance and society as a whole.\nOur beloved Shaykh, Khwaja Alauddin Siddiqui himself narrates that, in the district of Poonch, there is a village called Rajur Nami which Khwaja Ghaznavi visited during one of his spiritual tours. Whilst staying there, the villagers all invited him with great love and sincerity. One night after the Isha prayer, as usual, he delivered an educational speech. Throughout half the night, this gathering of dhikr and education continued and many people took bayah at his hands, vowing to live their lives according to the Straight Path, and thus entering into the tareeqa. In this village lived the poorest people, and the villagers requested Khwaja Ghaznavi, may Allah’s Mercy be upon him: “Huzoor, we are extremely poor in finance and resources. We wanted the privilege of inviting and hosting you, and we have been yearning for your blessed feet to grace this poor region. But there is no one amongst us who, alone, is financially capable of serving langar. For this reason, all of us villagers have come together to host you and serve the open langar. However, by Allah, we are so poor that, by morning, we will not be able to serve breakfast to your followers.”\nKhwaja Ghulam Mohiuddin Ghaznavi listened to the love and sincerity of these people, whilst also thinking about their poverty. Then he asked them to pray to Allah, and said, “Do not despair. Look at Allah’s Ways! Very soon, Allah Most High will transform your poverty into prosperity and you will become owners of assets who will be able to pay zakat.” What he said became reality; within a few years, the poverty of these villagers was no more. Wealth and prosperity encompassed the village and the people became asset owners, and were able to pay zakat. Now that village, like the rest of the region, is a place of happiness and affluence.\nGuft e oo guftullah buud,\nGarch e az halkum Abdullah buud\n(Persian couplet by Mawlana Rumi)\nOur noble Shaykh, Khwaja Alauddin Siddiqui also narrates that once, whilst staying in Makkah tul Mukarramah at the time of Hajj, one of the aforementioned villagers met Khwaja Ghaznavi and presented the Shaykh with some money as a gift. Khwaja Alauddin Siddiqui told him, ‘My brother, this is not the place for gifts or pleasantries,’ – to which the villager replied, ‘Janaab, this is not from my pocket but from that which the Shaykh has provided! Indeed, it is from the duaa of your pious father that we have been able to see this prosperity in our destiny.’\nIn short, wherever Khwaja Ghulam Mohiuddin Ghaznavi set his sacred feet, countless blessings of the seen and Unseen were showered upon that place, and hearts were filled with prosperity, steadfastness and the wealth of this world and the next. People were able to benefit from material and spiritual wealth, and their lives were transformed.\nUnka saaya ek tajalli,\nUnke naqsh e paa charaag,\nWoh jidar guzaare,\nUdar roshni hoti gaayi,\nMeaning: His very shadow is a beam of light!\nHis path is a candle,\nWherever he passes through,\nThere the light illuminates!"
        },
        {
            "title": "37. Style of Propagation and Teaching",
            "content": "The teaching style of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, was completely free from exaggeration and was not difficult for people to understand. He would teach challenging texts and complex words with great ease. His speeches were simple and easy to comprehend ensuring that every person, whether learned or unlearned, could benefit from his talks. He would usually deliver his teachings in a mix of Urdu, Pahari and Punjabi languages, and his normal speech was also in this style. He was very softly spoken and elegant in speech. Topics regarding tasawwuf, tareeqa, tawheed (Oneness of Allah) and risalat (Prophethood) were discussed with great humility and reverence. Khwaja Ghaznavi would unveil many spiritual treasures when discussing the times of the Prophets of Allah and the awliya. He would also interpret verses of the Holy Qur’an and the blessed Hadith in both the inner and outer contexts. Furthermore, when questioned by refuters about the miracles of Prophethood and the status of the awliya, he himself was able to respond from the appropriate perspective. Many profound philosophical issues were explained by him in understandable terms, which many learned scholars and philosophers found difficult and thus were astounded by this.\nHadhrat Mawlana Hidayatul Haqq Sahib narrates that, during conversation with a group of scholars and wise men, there came about the topic on the reality of the soul. Khwaja Ghulam Mohiuddin Ghaznavi requested the group to express their views on this. As requested, one or two of the scholars in attendance spoke on this topic applying references from Qur’an and Hadith, then Hadhrat Mawlana Hidayatul Haqq Sahib himself was asked to express his own view. Accordingly, he spoke on this philosophical subject in his own style. Finally, Khwaja Ghaznavi himself delivered such a speech on the reality of the soul that the rest of the group were astounded and in awe. They were amazed at the status of Khwaja Ghaznavi’s intellect and knowledge, admitting it had surpassed them and was unattainable for themselves. These words were like jewels at the bottom of the ocean of spiritual wisdom (irfan), and encompassed knowledge of the Unseen in this way.\nIn 1971, after Khwaja Ghulam Mohiuddin Ghaznavi had performed Hajj and ziyarah of Madinah tul Munawwarah, he went to the place of Gujranwala and stayed there at the house of a person named Kamunki Mundi. There was held a gathering of propagation and speeches which was in full flow, and amongst the attendees was Mufti Mohammad Shafi Sahib. When Sayyidi Khwaja Ghulam Mohiuddin Ghaznavi delivered an interpretation of Surah Inshira in his extraordinary and sacred manner, Mufti Sahib was overcome and in a loud voice, proclaimed “Allahu, Allahu!” In brief, Khwaja Ghaznavi’s speeches and sayings were blessed with a rare, humble and spiritual simplicity. Every word was precious and the scholars and intellectuals of the time were rendered breathless when they heard his speeches, which were full of evidence from the Qur’an, Hadith and sayings of the awliya. The hearts of the common and the elite were touched and their eyes would become filled with emotion.\nHadhrat Shah WaliAllah Muhaddith Dehlvi wrote in his famous book ‘Aqwaal e Jameel’: “Wa iza gaaba Shaykhu anhu yukhayyilu suratahu bayna aynaihi bi wasfil mahabbati wa ta’zeemi fatu feedu suratuhu ma tufeedu suhbatuhu.” Meaning: When you are not present with your Shaykh, it is advisable to contemplate with immense respect upon his presence and his company. Because tasawwur-e-Shaykh (focusing one’s mind and heart upon one’s Shaykh) grants you the same benefit as being present in one of his blessed gatherings.”\nTherefore, let us go from the focus of the world to the gathering and company of Khwaja Ghulam Mohiuddin Ghaznavi, by analysing his sayings and teachings to enlighten our hearts."
        },
        {
            "title": "38. Khwaja Ghulam Mohiuddin Ghaznavi’s Method of Bayah & Teachings",
            "content": "When anyone approached Khwaja Ghulam Mohiuddin Ghaznavi with the intention to take bayah, he would first explain the meaning of bayah and make them aware of its value. After this, he would ensure they were in the state of wudhu. He would then seat them in front of him on their knees, taking both their hands into his own, and ask them to recite the following verses:\n“Audhu billahihi minash Shaytanir rajeem, bismillahir Rahmanir Raheem. La ilaha illallahu Muhammadur RasulAllah. Ash-haduAllahu ilaha illallahu wahdahu la shareekalahu wa ash-hadu anna Muhammadan abduhu wa Rasuluh. Kufr se tawba, shirk se tawba, sab gunaah se tawba, qubool kiya tareeqa Naqshbandi Allahu Allahu Allahu..!”\n(Note: sometimes the Shaykh would also admit mureeds into the Qadri Silsila.)\nAfter this, the person would enter the folds of the Naqshbandiyya tareeqa. Then the Shaykh would advise them on the way of muraqaba isme zaat (meditating on ‘Allahu’) which is to close your mouth and eyes, and through breathing only, recite ‘Allah’ by breathing in and ‘hu’ breathing out. This method of bayah was for men. For women, it was not done in this way but instead, the women would sit slightly further from the Shaykh, reciting the aforementioned verses of bayah and then be accepted into the tareeqa. Muraqaba isme zaat was also then taught to them."
        },
        {
            "title": "39. Miracles (Karamah)",
            "content": "The visible miracles of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, are many in number and it is not possible to document them all. However, there are two of his miracles which are still alive today and will remain until the end of time. One of these is his establishment of Nerian Sharif, which is the spiritual and educational institution by which tens of thousands of people have attained sanctity and guidance. The second is his children who, by Allah’s Grace, blessings and Bounties, are proof of “Al Waladu sirrun li abeehi.” (A son is the prototype of his father.)\nThe greatest and most significant miracles of Khwaja Ghaznavi are asceticism (zuhd) and consciousness of Allah (taqwa), trust in Allah(tawakkul), endurance of difficulties (tahammul), patience(sabr), gratitude (shukr), spiritual striving (riyazat), inner struggle against the lower self (mujahada), sincerity (khaloos), dedicating everything for the Sake of Allah (lillahiyat), helpfulness and generosity (juud-o-sakha), empathy (eesar) and serving the people, remaining absorbed in the dhikr i.e./remembrance of Allah and His Beloved Messenger at all times, and adhering to the guidance of Shari’ah and Tareeqa with steadfastness upon these paths. These attributes are known to the people of Tareeqa as ma’anvi karamat i.e. profound spiritual miracles, and the opposite of these are hissi karamat i.e. apparent miracles. However, because the people in general see the hissi karamat, they believe that these are the pillars of wilayat. To summarise and mention all of the miracles would require a larger book and so for this reason, only a handful of Khwaja Ghaznavi‘s miracles are mentioned. His miracles and kashf (spiritual unveilings) are in such a great number and are very well-known.\nA. Reviving a Dry Well\nIt is reported that one time Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, went to the district of Mirpur to a village called Qattaar with the intention of doing tableegh. In the evening, the villagers presented themselves in his court and asked humbly, “Hadhrat, here we have only one well and it has been dry for twelve years. We travel many miles for clean water. Please pray to Allah Most High, so that through His Bountiful Power, He will cause this well to resume once again.”\nKhwaja Ghulam Mohiuddin Ghaznavi did accordingly, and also made duaa on a few small pebbles which he then placed into the well. He then raised his hands in prayer and said, “My Almighty (Ilaahi)! By the blessings of my Shaykh, please revive this well!” In the morning, the villagers saw that this well which had been dry for twelve years was now overflowing with water. After witnessing this great miracle, all of the villages took bayah into the NaqshbandiyyaTareeqa.\nB. From Idol Worshippers to Worshippers of Allah\nOnce, during a propagational tour, Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, visited the house of a Hindu who had invited him. When the Shaykh left that house to visit another house, the Hindu followed the Shaykh from a distance and observed that, in whichever room the Shaykh tread his blessed feet, the atmosphere itself became busy in the dhikr of Allah.\nWitnessing these scenes, the Hindu man became filled with wonder. Immediately, he presented himself in front of Shaykh Khwaja Ghaznavi and humbly said, “Hadhrat! In my heart, I am already aware of the greatness and sincerity of Islam. If you could instil the kalima into my heart, this life and the Hereafter would be made complete for me.” Khwaja Ghulam Mohiuddin Ghaznavi focused his spiritual concentration (tawajjuh) upon him and the Hindu recited the kalima, entering into the blessed circle of Islam.\nC. A Shawl as a Boat\nOnce, during a propagational tour, Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, headed for the River Poonch with a few of his followers. Due to the absence of a boat, his followers tied several planks of wood together with rope to make a float. Khwaja Ghaznavi boarded the float with them. When the float entered the river, the force of the current caused the ropes to loosen and the float was coming apart; the followers became concerned. Thereupon, Khwaja Ghaznavi immediately laid out his shawl on top of the broken float and told them to sit on it. When they reached the other side, he removed the shawl from the float, and saw that the float itself was in pieces. Thus, only the shawl had granted them safe passage across the river.\nD. Downpour of Rain\nIt is narrated that once, a work contractor approached Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, and humbly requested him: “O Hadhrat, we have arranged for thousands of wooden logs to be placed by the lake beneath the mountain. We are in anticipation that Allah Most High may bestow rain upon us so the logs may flow to their destination. However, for many months, we have seen no sign of rain and this has been troubling us. Please make duaa to Allah that blessed rains may shower upon us.” Khwaja Ghaznavi replied, “Go and stand next to your wooden logs. By the Will of Allah, through the blessings of my Shaykh, the rain is coming.” Indeed, they had just reached the wooden logs when a downpour of torrential rain began. Look at the Power of Allah in the fact that the rain poured only upon that mountain which had the wooden logs near it, thus the rain water carried all of the logs towards their destination.\nE. Restoration of Eyesight\nKhalifa Mohammad Hafeez Sahib narrates: “In a place called Mawza Barmooch, a blind elderly man had presented himself before Khwaja Ghaznavi and humbly requested for duaa that his vision be restored to him. So, for a few days, Khwaja Ghaznavi himself breathed dham (to blow upon a person whilst reciting Qur’an or dhikr) upon him and by the Grace of Allah, his eyesight was fully restored within a week.”\nF. Mother & Father Reunited With Son\nOnce, whilst travelling on one of his propagational tours, Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him was in a village in Mirpur when he observed the astonishing cleanliness of the 800-metres stretch of road ahead of him. When he enquired amongst the people about this, they told him that an elderly woman was responsible for this and she had used the cloth of her very own headscarf to sweep the road. Khwaja Ghaznavi called her and enquired as to the purpose behind this deed of hers. Weeping, she responded: “Hadhrat, for a period of 11-12 years, my son whose name is Mohammad Akbar has been missing. We have nothing in regards to his whereabouts. My husband and I have become aged and weak. Please make duaa to Allah Most High that we may be once again reunited with our son.”\nKhwaja Ghaznavi made duaa with immense focus and sincerity, and then responded: “Go, dear. Your son will inshaAllah be with you within thirteen days.” Thirteen days had not even passed when the boy indeed returned home. His parents then took him in the presence of Khwaja Ghaznavi, who asked him directly: “Son! Where have you been all this time?” He answered: “I was in the area of Tanni, shepherding camels. In the last few days, I had a severe fever so I lay down intending to relax but eventually I fell asleep. In my dream, I saw a person approach me. He took my hand and said, ‘Your parents are old, get up immediately and go and serve them.’ I woke immediately, left the camels and came here.”\nG. Protector from Major Calamities\nHadhrat Mawlana Mufti Hidayatul Haqq Sahib (Hazro Sharif) narrates that once, he was travelling on a bus that was driving extremely close to the mountainside. He relates: “Suddenly, there was panic as we approached a very deep ditch in the road. During this extreme danger, I felt that someone had grabbed my arm and pulled me out of the bus. When I looked up, I saw in front of me Huzoor Qibla Aalam (Khwaja Ghulam Mohiuddin Ghaznavi).”\nH. A Story about Khwaja Ghaznavi’s Gathering\nKhwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, was once addressing a large gathering. The audience were listening quietly and respectfully, with immense focus; the silence was such that you could hear people’s breathing. This was the atmosphere of the gatherings of Khwaja Ghaznavi’s speeches! Each person had their heads down, listening attentively and benefiting from the Shaykh’s words of wisdom. However, near the Shaykh’s seat, there was a table with a watch on it making a tick tock sound, which began to disturb the Shaykh whilst he was delivering his speech. Suddenly, he looked towards the watch with an intense look in his blessed eyes, and said: “Be quiet.” Immediately, the watch stopped. After the gathering, Khwaja Ghaznavi tried to fix the watch again but to no avail. Eventually, it was taken to a watch repair merchant who opened it, and upon careful inspection, could not find any signs of damage. He remarked in bewilderment, “I don’t understand. There is no sign of any damage so why will it not work?” In this way, two or three more watches were taken to him which he could neither repair and nor did they ever work again.\nI. Relief from Infestation of Spiders\nOnce, Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, was staying at the residence of one of his disciples (mureed) in the region of Thara. Some guests presented themselves before him and requested: “Huzoor! We have a request: please kindly come with us to help us with a problem we are facing.” So Khwaja Ghaznavi accompanied them to their farmlands, and there he saw that all of the fields, trees and leaves were infested with spiders which were destroying everything. They pleaded: “Huzoor, our crops are completely infected by spiders and our crops are ruined. Please make duaa that we may overcome this calamity and punishment!”\nAccordingly, Khwaja Ghulam Mohiuddin Ghaznavi lay his blessed prayer mat (musalla) upon that area of land, sat on his knees and made duaa with intense sincerity and devotion. Before the Shaykh could even finish his duaa, a large number of birds swooped down from above the mountain-tops and descended upon the spiders, finishing them all.\nJ. A Story of a Seeker of Truth\nHuzoor Shaykh ul Aalam, Khwaja Alauddin Siddiqui, narrates that a buzurg (elderly man) from Kamilpur by the name of Syed Gufran Shah Sahib presented himself before Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, and humbly expressed:\n“For thirty years, I have been in the service of my Shaykh however I have not yet obtained knowledge of the Unseen. Thus I mentioned this matter to him many times, saying: do I have a share of your spiritual wealth? My Shaykh replied, ‘Your share is definitely there’. However, the day before my Shaykh passed away, he called me to him and said, ‘Your share definitely exists but it is not with me.’ Please tell me, where should I go? I have spent my entire youth searching for this ‘wealth’. Now I am old and am still yet to find what I seek. Please have pity upon my state of distress and bestow your spiritual grace (fayz) upon my plight.”\nKhwaja Ghulam Mohiuddin Ghaznavi replied: “Shah Ji! The papers have been seen. If your share is in your destiny, then you shall surely receive it.”\nUpon receiving this answer, the Shah Sahib returned home. After some time, he returned to Khwaja Ghaznavi and asked: “Huzoor! Have you seen the papers yet or not?” Khwaja Ghaznavi, at that time, was drinking tea and there remained one last mouthful in the cup. The Shaykh raised the cup and said: “Shah Ji! I have seen the papers and your share definitely exists, but there is only as much as the tea in this cup.” Then the Shaykh gave the cup with the remaining tea to the Shah Sahib and said: “Take this, this is your share. Drink this tea.” The Shah Sahib took the cup from the Shaykh’s blessed hands and drank. As soon as he did so, his entire state changed. His consciousness and behaviour transformed, and he became so deeply absorbed in the spiritual realm that only the words ‘Hu, hu’ (variation of thedhikr of ‘Allahu’) were heard from him.\nThen Khwaja Ghaznavi told his khaadimeen (those who devote themselves to serving the people of Allah):“Lock this Shah Sahib in a house for forty days, and do not give him any supplies to eat or drink unless he himself makes a request.” Accordingly, the Shah Sahib was put into a house and locked in there for forty days. After a few days however, one of the Shah Sahib’s close relatives arrived and tried to forcefully release him from the house. He was successful. When Khwaja Ghulam Mohiuddin Ghaznavi received this news, he said: “Kaash! (How unfortunate!) If only he stayed in that house for the full forty days, he would have become a mard-e-kaamil (a Perfect Man) and a qalandar (a dervish of a high spiritual rank).”\nShaykh ul Aalam Khwaja Alauddin Siddiqui relates that he himself once met this Shah Sahib after the above-mentioned incident and asked: “Shah Ji, how did it go?” He replied, “Even though the incident did not work out for me, I now do not have any complaints about not achieving my goal.”\nK. Cure for an Incurable Disease\nA frail and elderly man who had leprosy once presented himself in front of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, and pleaded: “Huzoor! Due to this disease of mine, my family have banished me from the house and everyone despises me to the extent that noone comes near me.” Khwaja Ghulam Mohiuddin Ghaznavi responded: “Dear old man! Stay here with me. Eat from our blessed langar kitchen. Nobody will banish you from here.” Accordingly, he was given a plate from the langar kitchen, a bowl and a glass which were kept separate for him. Khwaja Ghaznavi also instructed the servants (khaadimeen) to provide this man with food and drink wherever he was seated.\nOne day, the old man was drinking water from the well of the DarbarSharifwhen coincidentally, Shaykh ul Aalam Khwaja Alauddin Siddiqui Sahib himself passed by and saw the old man withdraw water from the well with his own hands. The Shaykh was not pleased with this and admonished him, saying: “When you are being given food and water to eat and drink wherever you sit, why do you choose to contaminate the water of this well?” At that exact moment, Khwaja Ghaznavi came out of his hut (hujra sharif) and witnessed Shaykh ul Aalam admonishing the old leper. Taking pity upon the old man’s situation, Khwaja Ghaznavi called him towards himself and placed his own blessed hand into the old man’s hands, then passing it over his face and chest. He then said: “Old man, you will now become well. This illness will now end, and in future you will be able to sit with the rest of the guests on the main dastar khan (dining cloth).” Within three days, the old man was cured of leprosy and his body was completely free from this disease, so that he was able to sit with everyone else at the common dastar khan. After that, for a while, he also helped to prepare the food in the langar kitchen!\nHe would often say to Khwaja Alauddin Siddiqui Sahib: “Hadhrat! Because of your scolding, my life has been transformed.”\nL. A Seeker’s Request is Fulfilled\nKhwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, once stayed at the house of one of his close followers, Abdul Rahman Sahib. Abdul Rahman Sahib did not have any children, and he would serve the darbar and the khulafa (deputies) of Khwaja Ghaznavi with great devotion. That night, after the dhikr and speech gathering, one of Khwaja Ghaznavi’s khulafa, by the name of Khalifa Mahboob Shah Sahib, expressed: “Huzoor, Abdul Rahman is a very devout and sincere follower of yours. He has made sacrifices of his time and wealth for the sake of your blessed darbar, however he has no children of his own. Please make duaa in the Court of Allah that he may be blessed with children.”\nKhwaja Ghulam Mohiuddin Ghaznavi listened to the Khalifa Sahib’s request but remained silent. Thereafter, Khalifa Sahib made this request for three consecutive days on behalf of Abdul Rahman Sahib, but Khwaja Ghaznavi responded with silence.\nAround the seventh day, Khwaja Ghaznavi, may Allah’s Mercy be upon him, said to Khalifa Sahib: “Go and call Abdul Rahman Sahib to me.” Accordingly, Khalifa Sahib called Abdul Rahman for to the Shaykh, who hugged him three times and said: “Mubarak, mubarak, mubarak! (i.e. Congratulations!)”\nAbdul RahmanSahib asked humbly: “Huzoor, for what good news do you congratulate me?”\nKhwaja Ghaznavi replied: “I have made duaa to Allah Most High that you are blessed with three sons.”\nAccordingly, Allah Most High fulfilled Khwaja Ghulam Mohiuddin Ghaznavi’s duaa and with its blessings, Abdul Rahman Sahib was blessed with three sons who, by the Grace of Allah, are still alive today."
        },
       
          {
            "title": "40. Noble Children of Khwaja Ghulam Mohiuddin Ghaznavi",
            "content": "Allah Most High bestowed the great wealth of children upon Khwaja Ghulam Mohiuddin Ghaznavi in a truly blessed way. His first marriage was in Nerian Sharif, and from his first wife, he had 2 sons. The Shaykh married a second time and this wife bore him 4 sons. After her passing, Khwaja Ghaznavi married a lady from Chakwal from the district of Jhelum. She was very respectable and pious, and she bore him another son. \nAllah Most High bestowed the immense bounty of taqwa (fear of Allah) and purity upon the household of Khwaja Ghaznavi, such that all of his wives, children and khulafa (deputies) are an exact translation of Allah’s Words: “Rabbana hablana min azwaajina wa zurriyatina qurrata a’yunin waj’alna lil mutaqqeena imama.” [Qur’an 25:74]\n\nOf his 7 sons, here is presented a brief summary of each:\n\n1. Hadhrat Janab Pir Nizamuddin Qasmi, may Allah’s Mercy be upon him\n• Birth: 1937 (1357H)\nHadhrat Pir Nizamuddin Qasmi was the eldest son of Khwaja Ghulam Mohiuddin Ghaznavi. His early education was completed in Tararkhal School, after which he went onto Jamia Haqqa’iq al Uloom in Hazro to complete Dars e Nizami. After this, he was granted khilafat and sent to Afghanistan for propagation. He brought thousands into the Silsila Naqshbandiyya and was a dedicated leader in religious and community matters. He passed away at age 65 on 3rd March 1422H and was buried near his noble father in Nerian Sharif.\n\n2. Hadhrat Janab Khwaja Mohammad Alauddin Siddiqui\n• Birth: 1st January 1938 (1358H)\nA world-renowned Islamic scholar and debater, Khwaja Alauddin Siddiqui studied in Hazro and Faisalabad. He was granted khilafat by his father and contributed greatly to spreading the Silsila in Pakistan, Afghanistan, and the UK. Founder of the Naqshbandiyya (Mohiuddin) Trust and Noor TV, he influenced countless Muslims globally. He was chosen as the successor (sajjada nasheen) after his father's passing.\n\n3. Hadhrat Janab Pir Sahibzada Imam Rabbani Farooqi Sahib, may Allah’s Mercy be upon him\n• Birth: 1944\nPir Imam Rabbani Sahib studied in various Islamic institutions and was deeply influenced by his father. Although he could not complete Dars-e-Nizami due to his father's illness, he continued studying tafsir, Hadith and fiqh. He carried out numerous spiritual tours and had a noble character akin to his father. He passed away in an accident on 9th October 1997, aged 53, and was buried near his father.\n\n4. Hadhrat Janab Pir Sahibzada Fazal Rabbani Zahidi Sahib\n• Birth: 1957\nPir Fazal Rabbani Sahib was mentored at an early age by his father and Shaykh, Khwaja Ghulam Mohiuddin Ghaznavi and completed his Qur’anic studies and foundation of Islamiyat in the madrasa of Nerian Sharif. He then attended primary and secondary school until metric stage. At the request of his father, he then attended the famous educational institution in Behra Sharif for further Islamic studies, under the guidance of Mufassir-e-Qur’an, Huzoor Zia ul Ummat Hadhrat Allamah Pir Mohammad Karam Shah Sahib al Azhari, may Allah’s Mercy be upon him.\nAfter this, Khwaja Ghaznavi bestowed his bayah and khilafat upon him, and sent him to spread the teachings of Islam and aid those suffering from spiritual disease.\nIn appearance and character, habits and likeness, speech and actions, he is exactly like Khwaja Ghaznavi. He is also a true custodian of the seen and Unseen graces of Khwaja Ghulam Mohiuddin Ghaznavi. He is a brother of great loyalty and companionship along with his great and highly esteemed brother, Sajjada Nasheen Darbar Aalia Nerian Sharif, fountain of knowledge (ilm) of Shari’ah and Tareeqah, Hadhrat Allamah Khwaja Alauddin Siddiqui Sahib.\nHe is, also with Khwaja Alauddin Siddiqui Sahib, heavily involved the day-to-day running of Darbar Nerian Sharif and is the Shaykh’s right-hand man for matters involving Shari’ah and Tareeqat.\n\n5. Hadhrat Janab Pir Sahibzada Sher Rabbani Assad Sahib\n• Birth: September 1958\nPir Sher Rabbani Assad Sahib’s early Islamic studies were at the madrasa of Nerian Sharif and later he also studied the first books of Dars-e-Nizami in the presence of his noble father, Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him. He then attended Jamia Muhammadiyya Ghawthiya, Behra Sharif, under the guidance of Huzoor Zia ul Ummat Hadhrat Allamah Pir Mohammad Karam Shah Sahib al Azhari, may Allah’s Mercy be upon him. After completion of Dars-e-Nizami, Khwaja Ghaznavi gave him bayah and khilafat in the Naqshbandi tareeqah.\nHis beauty resembles that of his father, with very polite and respectful character. He is known to be very passionate and interested in religious and current affairs. He is also a very capable speaker, and an extremely prominent figure in the day-to-day running of Darbar Nerian Sharif.\n\n6. Hadhrat Janab Pir Sahibzada Ghulam Rabbani Sahib\n• Birth: 1962\nAt the age of 4, Pir Ghulam Rabbani Sahib began his early studies in the madrasa of Nerian Sharif in the presence of his noble father, Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him. He completed his metric studies in the school of Nerian Sharif, and his advanced Islamic studies with the ulama of Darbar Nerian Sharif.\nAfter his studies, he followed the sunnah of Sayyidina RasulAllah, peace and blessings of Allah be upon him, and became a businessman. With this dedication and passion, he slowly reached the Hijaz and also, by coincidence, he stayed within its blessed precincts. He spent some time in Madinah tul Munawwarah and also visited Makkatul Mukarramah, and was showered with the seen and Unseen fayz of both blessed lands. Whilst being a successful businessman, he also continued propagating the enlightened mission of his father, Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him.\n\n7. Hadhrat Janab Pir Sahibzada Shams ul Aarifeen Sahib\n• Birth: 15th January 1967\nThis Sahibzada is the youngest son of Khwaja Ghulam Mohiuddin Ghaznavi. Even though he was the youngest, he was not deprived of his father’s blessings and affection. His brothers, especially Shaykh ul Aalam Khwaja Alauddin Siddiqui Sahib, did not allow him to feel any less loved or blessed due to his young age. This great elder brother (Shaykh ul Aalam) taught and brought up his younger sibling. Such a display of love and closeness is an example of the Nervi generation and Pir Shams ul Aarifeen Sahib is in reality one of the suns (shams) of the Aarifeen (Knowers, or awliya).\nHis early education and mentoring was in the presence of his noble father, Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him. After studying in the madrasa of Nerian Sharif, he also studied Dars-e-Nizami, Arabic and Farsi/Persian in the Islamic school there. During his studies, he excelled in worldly and religious education.\nAfter his education, he continued with the family mission i.e. spreading the word of Islam in a peaceful and calm manner.\nBy the hukm (command) of Shaykh ul Aalam Khwaja Alauddin Siddiqui Sahib, he is now at the forefront of running Mohiuddin Islamic University, the Darbar of Nerian Sharif, Mohiuddin Medical College (Mirpur, AJK) and throughout the country, the thousands of madrasas, masjids, Islamic colleges, schools and other institutions."
          },
           
        
        {
            "title": "41. Noble Khulafa/Deputies",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, was the possessor of a fountain of spiritual grace (fayz). For the purpose of propagating Islam and the Path of the Sunnah, he spiritually mentored certain followers and bestowed khilafat upon them. After this, he designated them to different parts of the country so that they would “revive” those [hearts] which had died, guide the astray back to the Straight Path and rekindle the people’s love of Islam. Currently, within Pakistan, Afghanistan and Kashmir, in most of the major regions, Khwaja Ghulam Mohiuddin Ghaznavi’s khulafa are serving the cause of Islam and hosting gatherings of dhikr and tasawwuf. In this way, they are “feeding” the souls of those who were previously without it, and re-establishing the Fear of Allah and the Love of Sayyidina RasulAllah, peace and blessings of Allah be upon him, in their hearts.\nKhwaja Ghulam Mohiuddin Ghaznavi had 70 khulafa. Below is a list of those khulafa who we know of today.\n1. Ra’ees ul Khulafa, Hadhrat Allamah Mufti Hidayat ul Haqq Sahib, may Allah’s Mercy be upon him\n– Principle of Jamia Haqqa’iq ul Uloom, Hazro, Kimbalpur\nHe is one one of the most respected and celebrated khulafa of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him. All the scholars of Nerian Sharif were taught under his supervision, and he also oversaw the education of the sons of Khwaja Ghulam Mohiuddin Ghaznavi and Pir Saani Sahib.\n2. Hadhrat Janab Fayz Muhammad Sahib, may Allah’s Mercy be upon him\n– Tatta Paani, Azad Kashmir\nHe was one of the first to be with Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, during his early elevation (in sainthood/wilayat). During the initial establishment of Nerian Sharif, he undertook a great deal of effort in the khidmat of Darbar Sharif.\n3. Hadhrat Janab Pir Ghulam Hussain Sahib, may Allah’s Mercy be upon him\n– Terian Sharif, Kotli, Azad Kashmir\nHe was born on the 5th April 1905 in the province of Rajuli. At the age of 8, he took bayah with Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him. The Shaykh bestowed khilafat upon him before the inauguration of Pakistan in 1944. This is why he is in the first line of khulafa to be with Khwaja Ghulam Mohiuddin Ghaznavi.\nIn the process of spreading the Grace of wilayat of this blessed Darbar (Nerian Sharif), his own spiritual status increased rapidly. His blessed shrine is situated at the balcony of the masjid of Terian Sharif.\n**N.B. Author’s note: “Before I could complete the second part of this book, all three of the aforementioned khulafa passed away.”\n4. Hadhrat Janab Sayyid Mahboob Shah Sahib, may Allah’s Mercy be upon him\n– Terian Sharif, Kotli, Azad Kashmir\nHe spent a very long time in the presence and khidmat of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him. His piety and humility were his greatest characteristics. He is buried in Aastana Aalia Nerian Sharif.\n5. Hadhrat Janaab Mohammad Amir Khan, may Allah’s Mercy be upon him\n– Ghazni, Afghanistan\nUnder his supervision, every year, delegations of mureeds would arrive from Afghanistan to attend the Urs Mubarak of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him. He was martyred during the jihad for Afghanistan.\n6. Hadhrat Allama Mufti Abdul Malik Sahib Luqmanvi Hazarvi\n7. Janab Khalifa Sakhi Mohammad Sahib, may Allah’s Mercy be upon him\n8. Janab Sufi Fazal Ahmad Sahib, may Allah’s Mercy be upon him\n9. Hadhrat Janab Khalifa Mohammad Hafiz Sahib, may Allah’s Mercy be upon him\n10. Hadhrat Pir Janab Ghulam Mohammad Sahib, may Allah’s Mercy be upon him\n11. Hadhrat Janab Pir Al-Deen Sahib, may Allah’s Mercy be upon him\n12. Hadhrat Janab Khalifa Mohammad Shafi Sahib\n13. Hadhrat Janab Mohammad Arifullah Sahib\n14. Hadhrat Janab Khalifa Abdul Azeez Sahib\n15. Hadhrat Janab Sufi Alif Deen Sahib, may Allah’s Mercy be upon him\n16. Hadhrat Janab Sufi Mohammad Fazil Sahib\n17. Hadhrat Janab Khalifa Sufi Manzoor Hussain Sahib, may Allah’s Mercy be upon him\n18. Hadhrat Janab Sufi Sirajuddin Sahib\n19. Hadhrat Janab Khalifa Gulzar Hussain Sahib\n20. Hadhrat Janab Khalifa Fayz Mohammad Sahib, may Allah’s Mercy be upon him\n21. Hadhrat Janab Al Haj Khalifa Mohammad Bashir Sahib\n22. Hadhrat Janab Sufi Talib Hussain Sahib\n23. Hadhrat Janab Khalifa Mohammad Bashir Sahib Hazari\n24. Hadhrat Janab Mawlana Mohammad Abdullah Ateeq Sahib\n25. Hadhrat Janab Master Fazal Hussain Sahib\n26. Hadhrat Janab Khalifa Syed Ameer Sahib, may Allah’s Mercy be upon him\n27. Hadhrat Janab Sufi Mohammad Akram Sahib\n28. Hadhrat Janab Mawlana Mohammad Akbar Sahib\n29. Hadhrat Janab Khalifa Mohammad Azam Sahib\n30. Hadhrat Janab Khalifa Mohammad Rafeeq Sahib\n31. Hadhrat Janab Mawlana Mufti Mahmood Hussain Sahib\n32. Hadhrat Janab Al-Haj Sahibzada Mohammad Rafeeq Ahmad Sahib (Sajjada Nasheen, Terian Sharif)\n33. Hadhrat Janab Khalifa Mohammad Yusuf Sahib\n34. Hadhrat Janab Syed Matloob Hussain Shah Sahib\n35. Hadhrat Janab Khalifa Mohammad Anees Sahib\n36. Hadhrat Janab Syed Muneer Hussain Shah Sahib\n37. Hadhrat Janab Khalifa Faqeer Mohammad Sahib, may Allah’s Mercy be upon him\n38. Hadhrat Janab Khalifa Sitar Mohammad Sahib\n39. Hadhrat Janab Khalifa Ghulam Hussain Sahib\n40. Hadhrat Janab Mawlana Sakhi Mohammad Sahib (Maqbuza Kashmir)\n41. Hadhrat Janab Mawlana Abdul Shakoor Sahib\n42. Hadhrat Janab Khalifa Mohammad Shafi Sahib\n43. Hadhrat Janab Syed Shah Hussain Sahib\n44. Hadhrat Janab Khalifa Sakhi Mohammad Sahib (Azad Kashmir)\n45. Hadhrat Janab Doctor Gul Majeed Sahib\n46. Hadhrat Janab Khalifa Sahib Khan Sahib\n47. Hadhrat Mawlana Habeeb ul Rahman Sahib (Afghanistan)\n48. Hadhrat al Shaykh Nazeer Ahmad Sahib (Madinatul Munawwarah)\n49. Hadhrat Mawlana Habeeb ul Rahman Sahib (Azad Kashmir)\n50. Hadhrat Janab Doctor Syed Mohammad Ghazali Sahib\n51. Hadhrat Janab Khalifa Tariq Jameel Sahib\n52. Hadhrat Janab Khalifa Inayat Hussain Sahib\n53. Hadhrat Janab Khalifa Mazhar Iqbal Sahib\n54. Hadhrat Janab Pir Abdul Lateef Sahib\n55. Hadhrat Janab Khalifa Abdul Majeed Sahib\n56. Hadhrat Janab Khalifa Ali Akbar Sahib\n57. Hadhrat Janab Hafiz Jameeluddin Sahib\n58. Hadhrat Janab Hafiz Mohammad Hussain Sahib\n59. Hadhrat Janab Khalifa Mohammad Bashir Sahib\n60. Hadhrat Janab Khalifa Malik Mahdi Khan Sahib\n61. Hadhrat Janab Allama Pir Zaheeruddin Sahib (Jamia Mohiul Islam, Birmingham)\n62. Hadhrat Janab Allama Ghulam Jilani Sahib (Jamia Masjid, High Wycombe)\n63. Hadhrat Janab Mawlana Hafiz Tasadduq Hussain Sahib (Jamia Masjid, Bolton)\n64. Hadhrat Janab Khalifa Haji Abdul Rahman Sahib (Bradford)\n65. Hadhrat Janab Khalifa Maqsood Ahmad Sahib (Nottingham)\n66. Hadhrat Janab Khalifa Haji Nazeer Ahmad Sahib (Manchester)\n67. Hadhrat Janab Al-Haj Qamar ul Zaman Sahib, may Allah’s Mercy be upon him (Nottingham)\n68. The author of this book, Hadhrat Janab Khalifa Riaz Ahmad Samdani Sahib"
        },
        {
            "title": "42. Departure from this World",
            "content": "After this beaming light of sainthood had spent 46 years guiding people from darkness into the lightthe time had arrived for him, by the Laws of nature, to leave this limited world towards the eternal world. This is a time during which no friendship or relations will aid one.\nIndeed, it is important to differentiate here between ordinary, sinful Servants of Allah and the esteemed; for the esteemed Servants, this is a time of anticipation to be reunited with their Creator. It is due to this reason that the final stages of the lives of the esteemed Servants of Allah is not referred to as mawt (death), but wisaal (union). This is because they surpass the stage of death and are gifted with Reunion [with Allah Most High].\nThe death of the saints (awliya) is not death, but indeed, an embrace with their Creator. For this reason it is said: “Al mawtu jasrun yuusilu al Habeeba ilal Habeeb.” Meaning: ‘Death is a bridge which reunites one friend with another Friend.’ It is reported in Mishkat Sharif: “Inna Awliya Allahi la yamuutuna bal yantakiluuna min daarin ila daar.” Meaning: ‘Allah’s Friends do not die, but instead they migrate from one place to another.’\nThe accepted Servants of Allah, and Allah alone, know the actual reality of this wisaal. I (Khalifa Riaz Ahmad Samdani) shall now attempt to summarise the wisaal mubarak of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him."
        },
        {
            "title": "43. Beginning of Illness",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, was extremely ill for roughly a year. The Shaykh had been suffering from gall stones. Initially he did not pay much attention to it, but after the Urs in Nerian Sharif in 1974, his condition deteriorated with each passing day. His sons and advisors had no choice but to admit him to Rawalpindi hospital for treatment. Khwaja Ghaznavi initially refused, but eventually they were able to persuade him.\nAt first, the medical treatment was successful. Well-wishers and beloved followers went in vast numbers to meet him, and the atmosphere of the hospital had completely transformed. Throughout the day and night, the flow of visitors was consistent. The second time that the Shaykh’s health declined, he attended the military hospital at the special request of Colonel Mohammad Irfan Khan Sahib. All the arrangements and care for the Shaykh were undertaken by Major Abdul Rahman Sahib, and thus his degree of love, sincerity, aqeeda were obvious to see during this time. It was to the extent that he almost changed the entire atmosphere and interior of the hospital itself to reflect that of Darbar Nerian Sharif, and continuously catered to the needs of all visitors and well-wishers.\nWhenever Khwaja Ghulam Mohiuddin Ghaznavi was in difficulty, he would always call on Major Abdul Rahman Sahib and would speak to him with a very close, intimate bond. When the Shaykh’s troubles were alleviated, he would grant Major Sahib permission to leave. Additionally, whenever Major Sahib was late meeting him, the Shaykh would constantly enquire of his whereabouts; and during this waiting period, Master Sakhi Mohammad Sahib was the special mureed who would serve him.\nConsideration of Visitors\nKhwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, was extremely ill in hospital and extremely frail; despite this, the Sahibzadagaan and khuddaam were instructed to look after all visitors as they arrived and left the hospital. The effort which some visitors took to reach the hospital was acknowledged by Khwaja Ghaznavi with much appreciation and concern.\nMuch of the time, tea was ordered from the local restaurant and brought into the hospital for guests to drink. Some guests were given money personally by Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, and he said: “Go dear and eat food from the market, for you are my guest.” The visitors who came from far distances to visit the Shaykh would be given food and bedding accommodations near the hospital.\nAt one point, Hadhrat Janab Pir Ghulam Naqshband Sahib of Chura Sharif made his home into a temporary hostel for the visitors, which meant that day and night,langar sharif was served to visitors and they were able to rest and refresh themselves at ease.\nArrival of Hadhrat Pir Alauddin Siddiqui Sahib\nWhen the health of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, began to deteriorate with each day and his blessed body became increasingly frail, Hadhrat Pir Alauddin Siddiqui Sahib was in Birmingham (England) hosting a tour to propagate Islam. Hadhrat Pir Qasmi Sahib and Hadhrat Pir Farooqi Sahib called him and explained the grave circumstances, urgently requesting his return to Nerian Sharif.\nHadhrat Pir Alauddin Siddiqui Sahib immediately called Pir Saani Sahib’s son, Pir Abdul Ghaffar Sahib (of Keighley) and informed him of the news. On 26th August at 8:30am, these two sons of Nerian Sharif travelled from London to Islamabad, and straight away to Rawalpindi, then directly to the hospital to ask about the well-being of the great Shaykh. That same day, Khwaja Pir Saani Sahib, may Allah’s Mercy be upon him, and Sahibzada Abdul Irshad Sahib, also travelled from Nerian Sharif to Rawalpindi. Khwaja Ghulam Mohiuddin Ghaznavi’s health at that time was extremely unstable and he was in a state of unconsciousness.\nRejection of Operation\nKhwaja Ghulam Mohiuddin Ghaznavi’s doctors were of the opinion that within his stomach, particles of the stones had begun to spread throughout his blessed body. In this state, without having an operation, treatment was virtually impossible, thus his doctors insisted on performing the operation. The Shaykh refused.\nWhen the sahibzadagaan stressed the importance of the operation, the noble Shaykh replied: “Since the day my Pir-o-Murshid (Khwaja Pir Qasim Mohrvi Sahib) gave me khilafat till today, never have any of my salah become qaza (missed), nor have I ever been without wudhu. During the operation, this routine of my life will be disturbed. Salah and wudhu will be difficult for me to maintain during this period. Therefore, this operation is unacceptable for me.”\nIn response to this, Hadhrat Pir Alauddin Siddiqui Sahib pleaded: “In this state of illness, Shari’ah will excuse you for this. According to the recommendations of all of the doctors, if the operation is not carried out, the illness will last much longer and this would result in more salah being missed.”\nAccordingly, after hearing this request, Khwaja Ghulam Mohiuddin Ghaznavi gave his permission for the operation. This was the first operation that was extremely successful.\n1 ½ to 2 weeks later, the Shaykh’s health had vastly improved and he was discharged from hospital, after which he spent a few days at Mujaddidiya Manzil."
        },
        {
            "title": "44. Second Occurrence of Illness",
            "content": "For four or five months, Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, remained in good health.\nHowever, after a while, his illness returned and he was again taken to the Military Hospital where the operation was performed a second time. Here, a large amount of water was removed from his stomach, which consequently resulted in his extreme bodily weakness and fragility. Even in this condition, he remained in a state of wudhu at all times and was able to pray salah on time.\nThe doctors would object to this, asking him to refrain from performing wudhu and to pray salah by only performing rukuh and sujood through gestures, as they feared the stitches from the operation were in danger of becoming undone. However, Khwaja Ghulam Mohiuddin Ghaznavi refused this advice and responded: “In 46 years, I have never been without wudhu. Now, in the final period of my life, am I to remain without wudhu? I cannot accept this. During salah, I will perform rukuh and sujood regardless of whether or not the wounds open. Let the stitches become undone. I have no care for any of these matters. My entire life’s [spiritual] routine shall not now be broken.”\nAccordingly, despite extreme illness and his condition after the operation, he maintained wudhu at all times and prayed at all times. In this way, he ensured that his entire life’s routine remained intact.\nThis attribute of steadfastness (istiqaamat) is the true definition of: “Al istiqaamatu afdhalu min alfi karamatin.” Meaning, “Steadfastness is superior to a thousand miracles.”\nDuring these days of illness and fragility, the Shaykh stayed mainly in the Military Hospital of Rawalpindi where many well-wishers from all walks of life went to visit him. Amongst these were his murideen, friends and family. Aside from them, many Shuyukh and religious scholars also visited him."
        },
        {
            "title": "45. Spiritual Family of Mohra Sharif Come to Visit",
            "content": "The news of the critical condition of Khwaja Pir Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, had reached the door of the sajjada nasheen of Mohra Sharif, Ala Hadhrat Pir Mohammad Zahid Khan Sahib, may Allah’s Mercy be upon him, and he took it upon himself to visit the Shaykh in hospital.\nWhen Khwaja Ghaznavi found out about this, and as soon as he saw Khwaja Pir Mohammad Zahid Khan Sahib approaching, he stood up in respect, despite his physical weakness and pain, saying: “I heard that the Ka’bah will come to do the ziyarah of Allah’s Accepted Ones, and now with my own eyes, I have witnessed this to be true!”\nFrom Mohra Sharif, all of the blessed sahibzadagaan visited the hospital and stayed at Mujaddidiya Manzil. Their arrival and presence gave Khwaja Ghaznavi immense peace and contentment. Despite his own bodily weakness, the Shaykh tried to stand and pay his respects. Janab Pir Ghulam Naqshband Sahib, sajjada nasheen of Chura Sharif, would sometimes visit the Shaykh, and his younger brother Sahibzada Ghulam Murshid Sahib was often at the hospital."
        },
        {
            "title": "46. Effects of Sorrow",
            "content": "After the second operation, ill health and bodily weakness took over to such an extent that the doctors were surprised that a person could remain alive for so long [in such a condition]. Major Abdul Rahman Sahib said: “This is actually destiny versus the duaas of Pir Sahib’s mureeds. Destiny (taqdeer) is trying to take him away from this world, whilst his well-wishers and their duaas do not allow this to happen.”"
        },
        {
            "title": "47. Strength of Well-Wishers",
            "content": "When the doctors declared the illness of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, to be incurable, and his health was at the peak of weakness and fragility, his state was overcome by absorption (istigraaq) and unconsciousness. His eyes were now often closed and he hardly spoke. With every passing moment, his physical condition worsened.\nIn this situation, the restlessness and concern of his well-wishers was unbearable. They prayed to Allah for the Shaykh’s health to be improved and that he would be granted a long life, even asking that their own lives be given to him.\nEvery so often, the Shaykh would open his eyes, and those around him would witness this. He would raise his hands, and mime duaa for them. Then he would ask the sahibzadagaan and khuddaam, “Feed the guests and make them tea.” After this, he would return to the state of absorption once more. Then, after some time, he would ask, “Have you fed the guests and served them tea?” After which, he would return to his former state once more.\nFollowing the doctor’s advice, arrangements were made to take Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, back to Darbar Nerian Sharif. On 6th April, he was taken to visit Choudhury Yamin’s house. Choudhury Yamin is the fortunate one who hosted Khwaja Ghulam Mohiuddin Ghaznavi during the Shaykh’s last days.\nOn 5th April, I myself (the author) discovered that the Shaykh’s illness was incurable. I reached the hospital the next day, and found out that the Shaykh was staying in Choudhury Yamin Sahib’s house and was shortly due to return to Nerian Sharif. I met Choudhury Sahib and then had the privilege of doing ziyarah of Shaykh Khwaja Ghulam Mohiuddin Ghaznavi. At that time, he was in the same state of absorption (istighraaq) as he was in at the hospital. In the meantime, once or twice the Shaykh would say: “Take me home quickly.” Before departing for Darbar Nerian Sharif, Khwaja Pir Saani Sahib also arrived and was part of the travelling caravan.\nAt around 12:30 that afternoon, the car arrived to take Khwaja Ghulam Mohiuddin Ghaznavi and his followers back to Nerian Sharif. More vehicles came for the sahibzadagaan (sons) and khuddaam (followers/devotees).\nHadhrat Shaykh ul Aalam Khwaja Alauddin Siddiqui Sahib said: “Huzoor, please make duaa for Choudhury Sahib.” In response, Khwaja Ghulam Mohiuddin Ghaznavi opened his eyes and said something which we were unable to comprehend. When Sahibzada Farooqi Sahib lifted the Shaykh on both his arms, his (Sahibzada Sahib’s) eyes were filled with tears and all others present were unable to hold back their tears. Everyone in the gathering at that time were part of a picture of immense grief.\nSahibzada Farooqi Sahib helped the Shaykh into the car, and helped him to rest on the bed which was prepared for him inside it. Just before the car door closed, I (the author) was able to gain the virtue of kissing the Shaykh’s blessed feet."
        },
        {
            "title": "48. Caravan of Sorrow",
            "content": "On Sunday 6th April, at 1:30 in the afternoon, this sorrowful entourage left from Rawalpindi to Nerian Sharif. Along the way, when they reached Palandari, and they passed the well-known stores in the area, Khwaja Ghulam Mohiuddin Ghaznavi raised his hands and signaled for them to stop there. He said to Shaykh ul Aalam Pir Siddiqui Sahib: “Feed all the guests and give them tea.”\nIn accordance to this request, everyone was fed and served tea to drink, after which the group continued on towards Nerian Sharif.\nWhen the followers and close associates saw Khwaja Ghulam Mohiuddin Ghaznavi’s condition, Darbar Nerian Sharif was in a state of devastation. When the people living nearby and those further away had heard of the Shaykh’s critical state, and that he had returned to Nerian Sharif, hundreds of thousands turned up at Darbar Nerian Sharif, to then see the Shaykh in his continued state of absorption.\nVisitors would arrive to meet him in his room, and were able to perform ziyarah for a few minutes. Then Shaykh ul Aalam Pir Siddiqui Sahib would request them all to make duaa, and he himself would join in this duaa with them.\nI myself (the author) returned to Gujranwala the next day. In Rawalpindi, on the bus we were on, there was someone by the name of Pir Mian Jameel Ahmad Sahib, sajjada nasheen of Sharq Pura Sharif. He too was on his way to visit Khwaja Ghulam Mohiuddin Ghaznavi during the Shaykh’s final days."
        },
        {
            "title": "49. Day Before the Blessed Wisaal (Passing from this World)",
            "content": "The day before the great Shaykh’s departure from this world, it was a Thursday. He was in a state of unconsciousness, which was a cause for immense concern and anxiety for all around him. After a while, he returned to his state of asborption, and Shaykh ul Aalam Pir Siddiqui Sahib said that in this state, Khwaja Shaykh Ghulam Mohiuddin Ghaznavi opened his eyes and requested: “Everyone leave this room. Visitors are coming.”\nIn accordance to this request, the room was emptied and only Shaykh ul Aalam Pir Siddiqui Sahib and his brothers stood around their father’s pillow. However, some guests stood near the doorway hoping to meet the Khwaja Ghulam Mohiuddin Ghaznavi. Thereupon, Khwaja Ghaznavi himself signaled towards them, and said: “Move from the doorway. Visitors are coming.”\nIn reality, his eyes were closed. When everyone moved from the doorway, Khwaja Ghulam Mohiuddin Ghaznavi raised his hands in duaa and prayed within himself, after which he gestured as if he was showing someone/something the way out of the room.\nAfter this, he made duaa again and again in the same manner, and signaled towards the exit. He did this same action three or four times. Afterwards, addressing the sahibzadagaan (the Shaykh’s sons) and women of the household, he said: “Give my keys to Siddiqui Sahib.” Then he returned to his state of absorption."
        },
        {
            "title": "50. Departure from this World",
            "content": "That Friday night he spent in this state of absorption.\nIn the morning, people from far and near went to meet him and to pray the Jummah prayer. These people were fortunate enough to have met the great Shaykh for the last time.\nJust as the second adhaan of Jummah was called, Shaykh ul Aalam Hadhrat Pir Alauddin Siddiqui Sahib and his khuddaam arrived at the masjid. When the Imam finished the prayer, Hadhrat Pir Siddiqui Sahib was told that the health of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, was at an extremely critical stage, and he was extremely restless. Immediately, Hadhrat Pir Siddiqui Sahib reached the Shaykh’s room, and then after some time, at exactly 2.35pm on 11th April 1975, the blessed and exalted spirit departed from the body of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, and his noble face bowed to the right.\nAt that time, the visitors consisted of Khwaja Ghulam Mohiuddin Ghaznavi’s extremely close followers as well as the sahibzadagaan of Nerian Sharif, and at this point, all were in a state of distress and extreme grief.\nHadhrat Pir Siddiqui Sahib went to the masjid, and by that time, people had finished Jummah prayer. With a broken heart, tearful eyes and pained voice, he announced the news to the worshippers in the masjid. The atmosphere was overcome with despair and sorrow. At that time, the followers and devotees of Darbar Nerian Sharif experienced their own minor Qiyama [due to the immense tribulation].\nKhwaja Pir Saani Sahib, with great patience (sabr) and endurance, attempted to console the sahibzadagaan and the women and children with his words of condolence. The reality is that if the encouragement and strength of Khwaja Pir Saani Sahib, may Allah’s Mercy be upon him, was not apparent during that extremely dark period, the sahibzadagaan and followers of Nerian Sharif would not have been able to recover and overcome the utter calamity and grief of this moment.\nNews of Khwaja Ghulam Mohiuddin Ghaznavi’s passing reached the entire district of Poonch, both by word-of-mouth and by radio via Radio Azad Kashmir. Where possible, people reached Darbar Nerian Sharif immediately to pay their respects, and all the famous scholars and shuyukh contacted Nerian Sharif by phone to express their condolences.\nIndeed, wherever news spread of this shining Light of Ahlus Sunnah wal Jamaat, people went from East, West, North and South to perform their final ziyarah of this Leader of Truth.\nAt the same time, from Mohra Sharif, Ala Hadhrat Pir Zahid Khan Sahib, may Allah’s Mercy be upon him, sent a special message through one of his khuddaam. He adorned his words of comfort and condolence with his affection (shafqat) and grace (karam). He also advised his sons, Janab Awliya Badshah Sahib and Janab Keumaras Badshah Sahib, about how to prepare the grave as well as performing the ghusl and burial before sending them both on their way to Nerian Sharif.\nAs per these instructions, these sajjada nasheens of Mohra Sharif chose the area that was to be the resting place of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, and then dug the ground and prepared it for the burial. At that time, Pir Mohammad Keumaras Badshah Sahib and Janab Awliya Badshah Sahib chose the area for the burial, and the completion of it was overseen by Sahibzada Imam Rabbani Sahib, enduring the bitterly cold winter at that time.\nHadhrat Pir Alauddin Siddiqui Sahib made the arrangements for the ghusl and Hadhrat Pir Imam Rabbani Sahib, Janab Sahibzada Mohammad Shafiq Sahib (Thoder Sharif), Janab Pir Manzur Ilahi Sahib (Eidgah Sharif), Master Sakhi Mohammad Sahib, and Sufi Abdul Aziz Sahib (Lahore) were chosen to perform the ghusl of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, as well as shrouding him. They then tied an imamah sharif around the Shaykh’s blessed head and then applied ‘itr (fragrance) and scent over the imamah sharif and shroud (kafan)."
        },
        {
            "title": "51. Final Ziyarah of the Friend of Allah",
            "content": "After this, the blessed coffin of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah be pleased with him, was taken to the highest floor of the house. People came from far and wide to make this last ziyarah (i.e. see the late Shaykh and pay their respects), and the number of visitors were in their thousands. It was as though the entire region of Kashmir had been pulled towards Nerian Sharif at this time. Every person was eager for this last ziyarah. This routine continued for many days."
        },
        {
            "title": "52. Funeral Prayer (Namaz-e-Janaza)",
            "content": "» Watch: Shaykh ul Aalam speaking about the life & passing of Khwaja Ghaznavi (with English subs)\nOn Sunday, after the Zuhr prayer, the coffin of Khwaja Ghulam Mohiuddin Ghaznavi was lifted, and every person yearned to be one of the coffin-bearers. Of course this was not possible, and those unable to bear the coffin on their shoulders found solace in simply touching it and deriving its blessings.\nNerian Sharif being located on a mountainous region meant that there were no open fields for the funeral prayer to be hosted on. For this reason, the masjid was used for this purpose and Khwaja Ghaznavi’s coffin was situated near the mihrab at the front of the gathering.\nThe main hall of the masjid, the outside areas and huge tents were completely full. It was difficult to ascertain exactly how many people were present. On either side of the masjid, on the hills and high peaks, people were standing in line for the funeral prayer, such that it took a long time to straighten the rows (saff) of worshippers in preparation for the prayer. The sajjada nasheen of Mohra Sharif had arrived and they were to lead the Janaza prayer.\nBefore the prayer, Hadhrat Mawlana Mohammad Hayat Sahib recited the niyyah and as usual, he used the word “mayyit” i.e. deceased. Here, Qibla Pir Zahid Khan Sahib, may Allah’s Mercy be upon him, said: “This is not a mayyit – use the word “WaliAllah” (Friend of Allah) instead!” After the Janaza prayer, supplication was made and Pir Awliya Badshah Sahib spoke a few words about the situation and his thoughts and feelings.\nAfter this, Hadhrat Shaykh ul Aalam Pir Siddiqui Sahib spoke his few words of pain and sorrow. At this point, the listeners and attendees’ pain and grief was beyond explanation.\nThen the blessed coffin of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, was lifted and taken to the area designated for his mausoleum. Here too, thousands of people waited eagerly for the final ziyarah. Then his blessed body was taken out of the coffin and placed into the grave. This was all done under the supervision of Ala Hadhrat Pir Mohammad Zahid Khan Sahib, may Allah’s Mercy be upon him.\nAfter this, Khwaja Pir Saani Sahib and all the sahibzadagaan sealed the grave, amidst overwhelming and tearful crowds.\nMisleh aiwaan e sahar, marqad farozan ho tera,\nNoor se maamoor ye khaaki shabistaan ho tera\nMeaning: May the grave of yours be luminous like a hall in an early day break,\nAnd this earthly abode of rest remain full of brightness!\nI (the author) looked towards the clock and saw that it was 4.10pm, and the sun was setting rapidly. I thought that here, from the sky of wilayat/sainthood, one sun was setting in Kashmir amongst the high peaks and mountains of Nerian Sharif. This sun was now hidden. The candle of light had been extinguished, a world of gatherings and great knowledge had now been plunged into darkness. Amongst the people of tareeqa were now lines of funeral attendees. The hearts of three-hundred thousand mureeds were broken."
        },
        {
            "title": "53. Feeling of Sorrow & Al Fatiha",
            "content": "After the burial, Khwaja Pir Saani Sahib, may Allah’s Mercy be upon him, and Shaykh ul Aalam Khwaja Pir Siddiqui Sahib, as well as the other sahibzadagaan, went to the room of Khwaja Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, and sat on the floor next to his masnad (seating place).\nPeople came to offer their condolences, recite Al Fatiha and make duaa for his noble soul. From across Kashmir and Pakistan, numerous religious and spiritual personalities gave messages of condolence to Khwaja Pir Saani Sahib and the sahibzadagaan, however the majority attended in person.\nAmongst the attendees, the following are those who stood out:\n1. Ala Hadhrat Pir Mohammad Zahid Khan Sahib, Mohra Sharif – and his sons, Pir Aftab Ahmad Sahib, Pir Awliya Badshah Sahib and Pir Keurmas Badshah Sahib\n2. Hadhrat Janab Mian Jameel Ahmad Sahib, Sharaqpur Sharif\n3. Hadhrat Pir Mohammad Karam Shah Sahib, Behra Sharif\n4. Sahibzada Mian Naeem Uddin Sahib, Kayyan Sharif\n5. Janab Sahibzada Mohammad Shafiq Sahib, Thoder Sharif\n6. Pir Syed Mahmood Shah Sahib Gujrati\n7. Shaykh ul Qur’an, Hadhrat Mawlana Ghulam Ali Sahib Okarvi\n8. Shaykh ul Hadith, Hadhrat Mawlana Mohammad Meraj ul Islam, Behra Sharif\n9. Janab Pir Haroon ul Rashid Sahib, Mohra Sharif\n10. Janab Pir Mazoor Ilahi Sahib, Eidgah Sharif\n11. Shaykh ul Hadith, Mawlana Mufti Hidayat ul Haqq Sahib, Hazro\n12. Hadhrat Sahibzada Mohammad Rafiq Ahmad Sahib Bandli\nApart from these people, there were numerous others from religious and political backgrounds that came to offer condolence and Al Fatiha for Khwaja Ghaznavi, may Allah’s Mercy be upon him.\nThereafter, the scholars spoke about his life and ways, and his Islamic and spiritual works, during their Friday Jummah sermons. The masjids were full of people reciting Qur’an for his Isaal-e-Thawaab. Newspapers and radio stations were constantly delivering coverage on Khwaja Ghaznavi’s way of life and character, as well as his service to humanity.\n53A. Publications Regarding the Shaykh’s Departure from this World\nMany writers from Pakistan and Kashmir wrote articles about his departure. Amongst these, three articles are listed below:\n1. Monthly Ziya e Haram, Lahore\nAuthor: Hadhrat Allamah Pir Mohammad Karam Shah Sahib, may Allah’s Mercy be upon him\nHis article is as follows:\n“In Tararkhal, Azad Kashmir, there is a small dwelling which Pakistan and Kashmir know as Nerian Sharif. This previously unprosperous region was granted such a high status, that Allah Most High bestowed upon it an Accepted One of His Court, by the name of Khwaja Pir Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him.\nFor almost 50 years, this mard-e-kaamil (Perfected Man) gave life to those whose hearts were darkened or dead. Thousands of lost people placed their hands into his hands, and found the Way of Truth. By this, they found ishq-e-Ilahi (Divine Love) and ishq-e-Muhammadi (Muhammadan Love), peace and blessings of Allah be upon him. His splendid character was such that those who attended his blessed presence never left empty-handed. His entire life was spent propagating the dhikr of Allah and the Message of Islam. He was a custodian of the Prophetic Sunnah (sunnat-e-nabawi).\nI’m writing this with much sorrow and pain. Alas! This shining Light has disappeared from our vision, that Light which shone in the hearts of thousands across the world.\nInna lillahi wa inna ilayhi rajiuun (To Allah we belong, and to Him we return).\nOn behalf of Ziya-e-Haram, and all our members, brothers and teachers, we would like to express our condolences to the family, and to the thousands of the Shaykh’s followers. We too feel your pain and express our deep sorrow. By the Grace of Allah Most High, may He grant this great mard-e-kaamil a place extremely close to Him, and keep this fountain of fayz (spiritual grace) and blessing ever-flowing until Yawm al Qiyama. Ameen.“\n2. Monthly Tarjuman-e-Ahlus Sunnat, Karachi\n“O Hadhrat Sultan ul Masha’ikh (O Respected King of Scholars)! The hearts of the people of Ahlus Sunnah have been wounded by the same pain that the scholars and learned have been enduring over the last few days. The passing of Hadhrat Sultan ul Masha’ikh, Pir Ghulam Mohiuddin Ghaznavi, may Allah’s Mercy be upon him, sajjada nasheen Nerian Sharif, is the cause of this [grief].\nHadhrat Qibla Shaykh (Khwaja Ghaznavi) was indeed a Leader and visionary in Pakistani society, and in Azad Kashmir, his service to mankind is unparalleled. From his passing, the world of tareeqa has experienced a void which, in reality, cannot be filled (by anyone else). Qibla Shaykh has left behind tens of thousands of murideen who, at this moment in time, are spread throughout the globe. His blessed personality and character was an extremely strong pillar of Ahlus Sunnah wal Jamaat. His son, Hadhrat Allamah Pir Alauddin Siddiqui Sahib, has resided in England for a long period of time spreading the word of Islam, and he has fulfilled this successfully.\nWe have the utmost confidence that Sahibzada Shaykh Alauddin Siddiqui Sahib will carry on the legacy and mission of his father and Shaykh. We would like to express our condolences to the family of Khwaja Ghulam Mohiuddin Ghaznavi, and we pray that Allah Most High bestows tens of thousands of blessings upon the enlightened and auspicious mausoleum of Sultan ul Masha’ikh, and that within the Gardens of Jannah, he is granted the best of abodes. Ameen.”\n3. Monthly Raza-e-Mustafa, Gujranwala\n“Hadhrat Khwaja Ghulam Mohiuddin Ghaznavi Naqshbandi (sajjada nasheen Darbar Nerian Sharif, Azad Kashmir) has passed away – inna lillahi wa inna ilayhi rajiuun.\nHe was amongst the elite khulafa of Khwaja Pir Qasim Mohrvi, may Allah’s Mercy be upon them both, and was the custodian of the Naqshbandi tareeqa in terms of his miracles and his success in spreading the tawhid of Allah Most High and Sunnah of the Messenger of Allah, peace and blessings of Allah be upon him.\nDuring the reign of this great King (Khwaja Ghaznavi), his presence was the best of all gifts. He has around three hundred thousand murideen, and his main strongholds were Kashmir, Pakistan, Afghanistan and England. His passing has caused the Ahlus Sunnah wal Jamaat and the world of tareeqa to be left without a true Leader.”"
        },
        {
            "title": "54. Forty Day Mourning (Khatam/Chelum Sharif)",
            "content": "Khwaja Ghulam Mohiuddin Ghaznavi’s Khatam Sharif was set on the 23rd May, and his yearly Urs Mubarak was exactly one month later – so, according to the wishes of the sajjada nasheen of Mohra Sharif, the Khatam Sharif and Urs Mubarak were combined into three consecutive days.\nThe agenda and posters for the Urs Mubarak were distributed throughout the country."
        },
        {
            "title": "55. Extraordinary Birds Around the Mausoleum",
            "content": "A few weeks before the Khatam Sharif, after the Isha prayer, flocks of extraordinarily-coloured birds encircled the blessed darbar. The sky was filled with these unusual creatures as far as the eye could see, soaring high in the night sky. After a while, they began to descend towards the blessed mausoleum (of Khwaja Ghulam Mohiuddin Ghaznavi) and hovered above it. They then entered inside and flew around the blessed feet and head of the mausoleum. They then would leave through one of the other doors. Thousands of these birds did exactly the same, and left in the same manner. It is worth noting, they also carried an extremely beautiful scent, as if from Jannah, and the air was thick with this fragrance.\nThe masjid guest rooms and large tent had uncountable birds flying around them. Amongst the strange things was the fact that they were completely unafraid of the humans around them, and many of the onlookers actually caught some of them but Hadhrat Pir Alauddin Siddiqui Sahib requested them to let the birds go.\nThis sequence of events carried on throughout almost half the night, but in the morning, no one knew in which direction the birds had fled."
        },
        {
            "title": "56. Recitation of Qur’an & Isaal-e-Thawaab",
            "content": "The students in the masjid of Darbar Nerian Sharif started to recite Qur’an from the day that Khwaja Ghaznavi had passed away. After his burial to the day of the Khatam Sharif, the recitation of the Qur’an did not stop and uncountable Khatam-e-Qur’an were completed, along with uncountable recitations of the kalima, durood sharif and other surahs.\nThe khulafa and followers held Qur’an recitations within their own homes, after which, when the time for duaa arrived, thousands and thousands of recitations were gathered together which were beyond enumeration. This is the extent of Qur’an khatams, durood, kalima recittaions had taken place.\nSome people from Gujranwala purchased an extremely expensive cloth (chaadar) to adorn the blessed mausoleum, on which verses of the Qur’an, the kalima tayyibah and other verses were inscribed.\nDuring this occasion, the sahibzadagaan of Mohra Sharif, as well as the masha’ikh of Kashmir and Pakistan, all gathered to take part. After the Zuhr prayer, as per usual, tilawat-e-Qur’an and recitation of naat sharif, as well as the shajra sharif, were recited. Duaa was made for the Isaal-e-Thawaab of the auspicious soul of Khwaja Ghulam Mohiuddin Ghaznavi."
        },
        {
            "title": "57. Sajjada Nasheen (spiritual heir/successor)",
            "content": "Before the Khatam Sharif, the sons of Khwaja Ghulam Mohiuddin Ghaznavi all agreed that Hadhrat Qibla Pir Alauddin Siddiqui Sahib would be his successor as well as the heir of his role (gaddi). Khwaja Ghulam Mohiuddin Ghaznavi’s younger brother, Khwaja Pir Saani Sahib, on behalf of himself and his family, also approved of this decision and with his own blessed hands, bestowed the dastaar (imamah sharif) upon Hadhrat Pir Alauddin Siddiqui Sahib’s noble head.\nIn accordance with this, and as per usual, the duaa at the end of the Khatam Sharif was made by Khwaja Pir Saani Sahib, may Allah’s Mercy be upon him, and he also announced the great news that Hadhrat Pir Alauddin Siddiqui Sahib was to be the sajjada of Nerian Sharif and the owner of the masnad of the darbar.\nAfter this, Hadrat Sahibzada Awliya Badshah Sahib bestowed him with the khilafat of Mohra Sharif on behalf of Ala Hadhrat Khwaja Pir Zahid Khan Sahib. Finally, Hadhrat Pir Alauddin Siddiqui Sahib stood and spoke a few words:\n“I have always thought myself an ordinary servant of this great darbar, and I will continue my khidmat (service) in this way for the future. Even if, instead of me, one of my younger brothers was assigned to the masnad, I would still be the first one to serve this darbar. As far as the role of sajjada nasheen goes, in regards to myself, the real sajjada nasheen is in this mausoleum and we are all taking sanctuary beneath this great tree.\nNevertheless, my weak shoulders have this great burden bestowed upon them, and may Allah Most High assist me through the help of my brothers and the duaas of my blessed uncle, Qibla Pir Saani Sahib, so that this huge responsibility may be fulfilled.”"
        }
    ]
    
  }

